In [1]:
with open("Abhishek.txt","r") as f:
    result = f.read()
    print(result)

Data Science:
    It is an Interdisciplinary field that uses Scientific methods, processes, algorithms and systems to extract knowledge
    and insights from noisy, structured and unstructured data, and apply knowledge from data across a broad range of
    application domains.1st:- Data Science
 2nd:- Machine Learning
 3rd:- Deep Learning
 4th:- Natural Language ProcessingHe is God owns soldier1st:- Data Science
 2nd:- Machine Learning
 3rd:- Deep Learning
 4th:- Natural Language ProcessingHe is god owns soldier

In [2]:
with open("Abhishek.txt","r")as f:
    result = f.readline()
    print(result)

Data Science:

In [3]:
text = """1st:- Data Science
 2nd:- Machine Learning
 3rd:- Deep Learning
 4th:- Natural Language Processing"""
with open("Abhishek.txt","a") as f:
    f.write(text)
    f.close()

In [4]:
with open("Abhishek.txt","r") as f:
    result = f.read()
    print(result)

Data Science:
    It is an Interdisciplinary field that uses Scientific methods, processes, algorithms and systems to extract knowledge
    and insights from noisy, structured and unstructured data, and apply knowledge from data across a broad range of
    application domains.1st:- Data Science
 2nd:- Machine Learning
 3rd:- Deep Learning
 4th:- Natural Language ProcessingHe is God owns soldier1st:- Data Science
 2nd:- Machine Learning
 3rd:- Deep Learning
 4th:- Natural Language ProcessingHe is god owns soldier1st:- Data Science
 2nd:- Machine Learning
 3rd:- Deep Learning
 4th:- Natural Language Processing

In [5]:
with open("Abhishek.txt","r") as f:
    result = f.readlines()
    final = result[-2:]
    print(final)

[' 3rd:- Deep Learning\n', ' 4th:- Natural Language Processing']

In [6]:
with open("Abhishek.txt","r") as f:
    result = f.readlines()
    print(result)

['Data Science:\n', '    It is an Interdisciplinary field that uses Scientific methods, processes, algorithms and systems to extract knowledge\n', '    and insights from noisy, structured and unstructured data, and apply knowledge from data across a broad range of \n', '    application domains.1st:- Data Science\n', ' 2nd:- Machine Learning\n', ' 3rd:- Deep Learning\n', ' 4th:- Natural Language ProcessingHe is God owns soldier1st:- Data Science\n', ' 2nd:- Machine Learning\n', ' 3rd:- Deep Learning\n', ' 4th:- Natural Language ProcessingHe is god owns soldier1st:- Data Science\n', ' 2nd:- Machine Learning\n', ' 3rd:- Deep Learning\n', ' 4th:- Natural Language Processing']

In [7]:
with open("Abhishek.txt","r") as f:
    result = f.readlines()
    print("No of lines in the text are:",len(result))

No of lines in the text are: 13

In [8]:
with open("Abhishek.txt","r") as f:
    result = f.read()
    print(result)
    print("Number of words in text file are:",len(result))

Data Science:
    It is an Interdisciplinary field that uses Scientific methods, processes, algorithms and systems to extract knowledge
    and insights from noisy, structured and unstructured data, and apply knowledge from data across a broad range of
    application domains.1st:- Data Science
 2nd:- Machine Learning
 3rd:- Deep Learning
 4th:- Natural Language ProcessingHe is God owns soldier1st:- Data Science
 2nd:- Machine Learning
 3rd:- Deep Learning
 4th:- Natural Language ProcessingHe is god owns soldier1st:- Data Science
 2nd:- Machine Learning
 3rd:- Deep Learning
 4th:- Natural Language Processing
Number of words in text file are: 616

In [9]:
import shutil
with open("Copy.txt","r") as f:
    result = f.readlines()
    print(result)

shutil.copy("Abhishek.txt","Copy.txt")

with open("Copy.txt","r") as f:
    result = f.readlines()
    print(result)

['Data Science:\n', '    It is an Interdisciplinary field that uses Scientific methods, processes, algorithms and systems to extract knowledge\n', '    and insights from noisy, structured and unstructured data, and apply knowledge from data across a broad range of \n', '    application domains.1st:- Data Science\n', ' 2nd:- Machine Learning\n', ' 3rd:- Deep Learning\n', ' 4th:- Natural Language ProcessingHe is God owns soldier1st:- Data Science\n', ' 2nd:- Machine Learning\n', ' 3rd:- Deep Learning\n', ' 4th:- Natural Language Processing']
['Data Science:\n', '    It is an Interdisciplinary field that uses Scientific methods, processes, algorithms and systems to extract knowledge\n', '    and insights from noisy, structured and unstructured data, and apply knowledge from data across a broad range of \n', '    application domains.1st:- Data Science\n', ' 2nd:- Machine Learning\n', ' 3rd:- Deep Learning\n', ' 4th:- Natural Language ProcessingHe is God owns soldier1st:- Data Science\n', ' 2nd:- Machine Learning\n', ' 3rd:- Deep Learning\n', ' 4th:- Natural Language ProcessingHe is god owns soldier1st:- Data Science\n', ' 2nd:- Machine Learning\n', ' 3rd:- Deep Learning\n', ' 4th:- Natural Language Processing']

In [10]:
from datetime import datetime 

current_datetime = datetime.now()
print("Current date is:",current_datetime)

# Current year 
current_year = current_datetime.year
print("Current year is:",current_year)

# Month of the year
result = current_datetime.strftime("%B")
print("Month of the year:",result)

# Week number of the year
result = current_datetime.strftime("U")
print("Week number of the year:",result)

# Weekday of week 
result = current_datetime.strftime("%A")
print("Weekday of week:",result)

# Day of Year 
result = current_datetime.strftime("%j")
print("Day of Year:",result)

# Day of Month
result = current_datetime.strftime("%d")
print("Day of Month:",result)

# Day of the week 
result = current_datetime.strftime("%A")
print("Day of the Week:",result)

Current date is: 2024-03-19 05:42:32.645951
Current year is: 2024
Month of the year: March
Week number of the year: U
Weekday of week: Tuesday
Day of Year: 079
Day of Month: 19
Day of the Week: Tuesday

In [11]:
year = int(input("Enter a year:"))

if (year % 4 == 0 and year % 100 != 0) or (year % 400 == 0):
    print(f"{year} is a leap year") 
else:
    print(f"{year} is not a leap year")

2024 is a leap year

In [12]:
year = int(input("Enter a year:"))

if (year % 4 == 0 and year % 100 != 0) or (year % 400 == 0):
    print(f"{year} is a leap year")
else:
    print(f"{year} is not a leap year")

2025 is not a leap year

In [15]:
date_format = "jan 1 2014 2:43PM"
date1 = "%b %d %Y %I:%M%p"
result = datetime.strptime(date_format, date1)
result

datetime.datetime(2014, 1, 1, 14, 43)

In [16]:
from datetime import timedelta
current_datetime = datetime.today()
result = current_datetime + timedelta(days=5)
result

datetime.datetime(2024, 3, 24, 6, 17, 47, 976829)

In [17]:
current_datetime = datetime.today()
new_date = current_datetime + timedelta(days=-1)
print("Yesterday date: ", new_date)
result = current_datetime + timedelta(days=0)
print("Todays date: ", result)
result = current_datetime + timedelta(days=+1)
print("Tommorrow date: ", result)

Yesterday date:  2024-03-18 06:21:06.990388
Todays date:  2024-03-19 06:21:06.990388
Tommorrow date:  2024-03-20 06:21:06.990388

In [18]:
current_datetime = datetime.now().date()
for i in range(5):
    new_date = current_datetime + timedelta(days=i)
    print("Tommorrow date: ", new_date)

Tommorrow date:  2024-03-19
Tommorrow date:  2024-03-20
Tommorrow date:  2024-03-21
Tommorrow date:  2024-03-22
Tommorrow date:  2024-03-23

In [19]:
current_datetime = datetime.now()
print("Todays date: ", current_datetime)
result = current_datetime.replace(microsecond=0)
result

Todays date:  2024-03-19 06:29:52.554434

datetime.datetime(2024, 3, 19, 6, 29, 52)

In [20]:
import os 
os.rename("Copy.txt","Copy1.txt")

In [21]:
os.getcwd()

'd:\\abhi python\\Python hands on\\Python-Hands-ON'

In [22]:
os.listdir()

['.git',
 'Abhi',
 'Abhishek.txt',
 'adaboost.ipynb',
 'Adaboost_Ass.ipynb',
 'ai4i2020.csv',
 'Ann_implementation.ipynb',
 'Assignment_1.ipynb',
 'Assignment_10.ipynb',
 'Assignment_11.ipynb',
 'Assignment_12.ipynb',
 'Assignment_13_LinearR.ipynb',
 'Assignment_2.ipynb',
 'Assignment_3.ipynb',
 'Assignment_4.ipynb',
 'Assignment_6.ipynb',
 'Assignment_7.ipynb',
 'Assignment_8.ipynb',
 'Assignment_9.ipynb',
 'Assignment_DT.ipynb',
 'Assignment_KNN.ipynb',
 'autos_dataset.csv',
 'Bangalore.ipynb',
 'Bengaluru_House_Data.csv',
 'Book2.csv',
 'Boston.csv',
 'CNN.ipynb',
 'CNN_proj_explanation.ipynb',
 'CNN_rev.ipynb',
 'Copy1.txt',
 'Country_clusters.csv',
 'DataFrame.csv',
 'DataFrame.xlsx',
 'dataset_es_train.csv',
 'Decision tree HYP_Tuning.png',
 'Decision Tree.png',
 'DecisionTree.ipynb',
 'Decision_Tree.png',
 'Decision_Tree_HYP.png',
 'Decision_Tree_REG_WithoutHYP.png',
 'Decision_TRee_Working.ipynb',
 'Deep_Learning.ipynb',
 'Deep_Learning_rev.ipynb',
 'DegreeofFreedom.png',
 'diabetes.csv',
 'Dim_red_tech.ipynb',
 'DRT.REV.ipynb',
 'DT_multiclass_clf.ipynb',
 'DT_Multiclass_clf_withoutHYP.png',
 'DT_Pruning.ipynb',
 'DT_pruning_revision.ipynb',
 'DT_regression.ipynb',
 'Elbow_method.png',
 'Emp_data.csv',
 'Emp_Records.xlsx',
 'emp_test1.csv',
 'heart.csv',
 'iframe_figures',
 'Imp_Interview_approach.ipynb',
 'IMP_Questions.ipynb',
 'Interview_questions.ipynb',
 'Iris.csv',
 'kmeans_clustering.ipynb',
 'KNN_all_clustering.ipynb',
 'KNN_classification.ipynb',
 'KNN_Clustering_Ass.ipynb',
 'Knn_Imputer.ipynb',
 'KNN_Regression.ipynb',
 'KNN_revision.ipynb',
 'Linear_reg_assignment.ipynb',
 'Linear_reg_theory.ipynb',
 'loan_data.csv',
 'Logistic_reg_assignment.ipynb',
 'movies_data.csv',
 'Naive_Bayes.ipynb',
 'Naive_Bayes_Ass.ipynb',
 'neg',
 'NLP.ipynb',
 'NLP_mini_project',
 'NLP_rev.ipynb',
 'PCA.ipynb',
 'PCA_rev.ipynb',
 'pos',
 'Predictive maintenance.ipynb',
 'Project.ipynb',
 'Prompt_Engineering.ipynb',
 'Python 1.ipynb',
 'python 10.ipynb',
 'python 11.ipynb',
 'python 12.ipynb',
 'python 2.ipynb',
 'python 3.ipynb',
 'python 4.ipynb',
 'python 5.ipynb',
 'python 6.ipynb',
 'python 7.ipynb',
 'python 8.ipynb',
 'python 9.ipynb',
 'Python_13.ipynb',
 'Python_14.ipynb',
 'Python_15.ipynb',
 'python_16.ipynb',
 'Random_forest_clf.ipynb',
 'README.md',
 'Sample.xls',
 'Sample1.xlsx',
 'Sampling.ipynb',
 'Scoring.png',
 'Social_Network_Ads.csv',
 'student.csv',
 'Support_vector_machine.ipynb',
 'SVM_Assignment.ipynb',
 'titanic.csv',
 'Train.csv',
 'weather.csv',
 'weather1.csv',
 'word2vec.model']

In [2]:
import re 
string = "Python and Machine Learning 7741 is syllabus of Data Science."
result = re.findall(r"\w{1,}",string)
result

['Python',
 'and',
 'Machine',
 'Learning',
 '7741',
 'is',
 'syllabus',
 'of',
 'Data',
 'Science']

In [3]:
string = "Python and Machine Learning is syllabus of data science and deep learning."
result = re.split(r"and",string)
result

['Python ',
 ' Machine Learning is syllabus of data science ',
 ' deep learning.']

In [4]:
string = "Python and Machine Learning is syllabus of data science and deep learning."
result = re.split(r"is",string)
result

['Python and Machine Learning ',
 ' syllabus of data science and deep learning.']

In [11]:
str1='Python and Data Science Batch 2023'
result = re.findall(r"\b[a-z]{1,}\b",str1)
result

['and']

In [12]:
str1='Python and Data Science Batch 2023'
result = re.findall(r"\b[a-z]{1,}\b",str1)
result

['and']

In [13]:
sample_string = "There are 123 45 678 90 2345 67 12 345 6789 0123 three-digit"
result = re.findall(r"\b\d{3}\s\d{2}\b",sample_string)
result

['123 45', '678 90']

In [20]:
str1= "python and data pytthon science pythonnn pyyth annd pythh"
result = re.findall(r"p+",str1)
result

['p', 'p', 'p', 'p', 'p']

In [21]:
str1 = 'We can write INFORM in lowercase as inform'
result = re.findall(r"INFORM|inform",str1)
result

['INFORM', 'inform']

In [22]:
str1 = 'We can write INFORM in lowercase as inform'
result = re.findall(r"INFORM|inform",str1)
result

['INFORM', 'inform']

In [25]:
str1= " data science and pytthon science abbbss and pyt"
result = re.findall(r"py*",str1)
result

['py', 'py']

In [26]:
str1= "python and data pbbbtthon science pytbbbonnn and pyt"
result = re.findall(r"\b\w*[b]{3}\w*\b",str1)
result

['pbbbtthon', 'pytbbbonnn']

In [27]:
str1= "python and data pbbbtthon science pytbbbonnn and pyt"
result = re.findall(r"\b\w*[b]{3}\w*\b",str1)
result

['pbbbtthon', 'pytbbbonnn']

In [29]:
str1= "abbbs and data abbbsolutely science abbrivation and pyt"
result = re.findall(r"\b\w*[b]{2,}\w*\b",str1)
result

['abbbs', 'abbbsolutely', 'abbrivation']

In [30]:
str1= "abbbs and data abbbsolutely or science an abbrivation and pyt"
result = re.findall(r"\b\w{3,5}\b",str1)
result

['abbbs', 'and', 'data', 'and', 'pyt']

In [31]:
str1= "abbbs and data abbbsolutely or science an abbrivation and pyt"
result = re.findall(r"\b[k-n]{3,}\b",str1)
result

[]

In [32]:
str1= "abbbs and data abbbsolutely or science_ an abbrivation_ and pyt_"
result = re.findall(r"[a-z]+[_]",str1)
result

['science_', 'abbrivation_', 'pyt_']

In [33]:
str1= "abbbs and data abbbsolutely or science_ an abbrivation_ and pyt_"
result = re.findall(r"[a-z]+[_]",str1)
result

['science_', 'abbrivation_', 'pyt_']

In [34]:
str1= "Abbbs and Data Abbbsolutely or Science_ an Abbrivation_ and pyt_"
result = re.findall(r"[A-Z][a-z]+",str1)
result

['Abbbs', 'Data', 'Abbbsolutely', 'Science', 'Abbrivation']

In [35]:
str1= "Abbbs and Data Abbbsolutely or Science_ an Abbrivation_ and pyt_"
result = re.findall(r"[A-Z][a-z]+",str1)
result

['Abbbs', 'Data', 'Abbbsolutely', 'Science', 'Abbrivation']

In [36]:
str1= "Abbbs and Data Abbbsolutely or Science_ an Abbrivation_ and pyt_"
result = re.findall(r"[A-Z][a-z]+",str1)
result

['Abbbs', 'Data', 'Abbbsolutely', 'Science', 'Abbrivation']

In [37]:
str1= "data absorb Science and Abbrivation and pyt"
result = re.findall(r"\ba.+b\b",str1)
result

['absorb']

In [38]:
str1= "data absorb Science and Abbrivation and pyt"
result = re.findall(r"\ba.+b\b",str1)
result

['absorb']

In [39]:
str1= "data absorb Science and Abbrivation and pyt"
result = re.findall(r"\ba.+b\b",str1)
result

['absorb']

In [40]:
str1 = 'Suceess is a jurney not a desti9nation.'
result = re.findall(r"Suceess",str1)
result

['Suceess']

In [41]:
str1 = 'new begening of LIFE .'
result = re.findall("LIFE .",str1)
result

['LIFE .']

In [42]:
str1 = "today is the very lazy day"
result = re.findall(r"\b[a-z]+[z]+[a-z]",str1)
result

['lazy']

In [43]:
str1 = "we have a lazy cat"
result = re.findall(r"[a-y]+[z]+[a-y]",str1)
result

['lazy']

In [44]:
str1 = "RudrANSHI_12345_wadekar"
result = re.findall(r"\w{1,}",str1)
result

['RudrANSHI_12345_wadekar']

In [45]:
str1 = "RudrANSHI_12345_wadekar"
result = re.findall(r"\w{1,}",str1)
result

['RudrANSHI_12345_wadekar']

In [49]:
str1 = "9821 maya"
result = re.findall(r"^9...",str1)
result

['9821']

In [50]:
str1 = "9821 maya"
result = re.findall(r"^\d*",str1)
result

['9821']

In [52]:
ip_adress="216.008.904.196"
result = re.sub(r"\b0.","",ip_adress)
result

'216.8.904.196'

In [53]:
ip_adress="216.008.904.196"
result = re.sub(r"\b0.","",ip_adress)
result

'216.8.904.196'

In [55]:
str1="Python is required for data science version 3.2"
result = re.findall(r"\d..\b",str1)
result

['3.2']

In [56]:
str1 = "Exercises number 1, 12, 13, and 345 are important"
result = re.findall(r"\b\d{1,}\b",str1)
result

['1', '12', '13', '345']

In [58]:
Sample_text ='The quick brown fox jumps over the lazy dog.'
Searched_words ='fox', 'dog', 'horse'
for i in Searched_words:
    result = re.findall(i , Sample_text)
    print(result)

['fox']
['dog']
[]

In [59]:
Sample_text ='The quick brown fox jumps over the lazy dog.'
Searched_words ='fox', 'dog', 'horse'
for i in Searched_words:
    result = re.findall(i , Sample_text)
    print(result)

['fox']
['dog']
[]

In [60]:
sample_text ='The quick brown fox jumps over the lazy dog.'
result = re.search("fox",Sample_text)
print(f"Start index is {result.start()} and end index is {result.end()}")

Start index is 16 and end index is 19

In [61]:
Sample_text = 'Python exercises, PHP exercises, C# exercises'
result = re.findall(r"exercises",Sample_text)
result

['exercises', 'exercises', 'exercises']

In [62]:
Sample_text = 'Python exercises, PHP exercises, C# exercises'
result = re.findall(r"exercises",Sample_text)
result

['exercises', 'exercises', 'exercises']

In [63]:
Sample_text = 'Python exercises, PHP exercises, C# exercises'
result = re.findall(r"exercises",Sample_text)
print(f"The ocuurence of the substring is:",len(result))
result = re.search(r"exercises",Sample_text)
print(f"The position of the substring is start from {result.start()} and end {result.end()}")

The ocuurence of the substring is: 3
The position of the substring is start from 7 and end 16

In [65]:
str1 = 'The quick brown fox jumps over the lazy dog.'
result = re.sub(r"[ ]","_",str1)
result

'The_quick_brown_fox_jumps_over_the_lazy_dog.'

In [66]:
result = re.sub(r"_"," ",result)
result

'The quick brown fox jumps over the lazy dog.'

In [67]:
str1 = 'The quick brown fox jumps over the lazy dog.'
result = re.sub(r"[ ]","",str1)
result

'Thequickbrownfoxjumpsoverthelazydog.'

In [68]:
str1= "python and data science pythonnn"
result = re.findall(r"[p]\w*",str1)
result

['python', 'pythonnn']

In [69]:
str1= "python and data science pythonnn"
result = re.findall(r"[p]\w*",str1)
result

['python', 'pythonnn']

In [70]:
str1= "python and data science pythonnn"
result = re.findall(r"[p]\w*",str1)
result

['python', 'pythonnn']

In [71]:
str1= "python and data science pythonnn"
result = re.findall(r"[p]\w{1,}",str1)
result

['python', 'pythonnn']

In [72]:
str1= "data science and python learning with begening every evening "
result = re.findall(r"\b[a,e]\w*",str1)
result

['and', 'every', 'evening']

In [73]:
str1 = "i am mrunal chaudhari ,my age is 24"
result = re.search(r"\d",str1)
result

In [74]:
str1 = "i am mrunal chaudhari ,my age is 24"
result = re.search(r"\d",str1)
result

In [76]:
text ="""Python. is a general,purpose, interpreted."""
result = re.sub(r"[,. ]",":",text)
result

'Python::is:a:general:purpose::interpreted:'

In [77]:
text ="""Python., is a general purpose interpreted."""
result = re.sub(r"[,. ]{2}",":",text)
result

'Python: is a general purpose interpreted.'

In [79]:
text ="""123 Python is a general-purpose, interpreted,
high-level programming language popularly used for
website development, data analytics 78 and automation."""

result = re.findall(r"\b\D{3,5}\b",text)
result

[' is a', 'high-', 'level', ' used', ' for\n', 'data ', ' and ']

In [80]:
text1 = '"Python", "Data", "Science"'
result = re.findall("""(.+?)""",text1)
result

['"',
 'P',
 'y',
 't',
 'h',
 'o',
 'n',
 '"',
 ',',
 ' ',
 '"',
 'D',
 'a',
 't',
 'a',
 '"',
 ',',
 ' ',
 '"',
 'S',
 'c',
 'i',
 'e',
 'n',
 'c',
 'e',
 '"']

In [1]:
import numpy as np 
arr1 = np.zeros(10)
arr1

array([0., 0., 0., 0., 0., 0., 0., 0., 0., 0.])

In [2]:
arr1 = np.zeros(10)
arr1

array([0., 0., 0., 0., 0., 0., 0., 0., 0., 0.])

In [3]:
arr1.nbytes

80

In [4]:
arr1 = np.zeros(10)
arr1
arr1[4] = 1 
arr1

array([0., 0., 0., 0., 1., 0., 0., 0., 0., 0.])

In [5]:
arr1 = np.arange(15,46)
arr1

array([15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31,
       32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45])

In [6]:
arr1

array([15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31,
       32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45])

In [7]:
arr1[::-1]

array([45, 44, 43, 42, 41, 40, 39, 38, 37, 36, 35, 34, 33, 32, 31, 30, 29,
       28, 27, 26, 25, 24, 23, 22, 21, 20, 19, 18, 17, 16, 15])

In [8]:
arr2 = list(reversed(arr1))
arr2

[45,
 44,
 43,
 42,
 41,
 40,
 39,
 38,
 37,
 36,
 35,
 34,
 33,
 32,
 31,
 30,
 29,
 28,
 27,
 26,
 25,
 24,
 23,
 22,
 21,
 20,
 19,
 18,
 17,
 16,
 15]

In [10]:
arr1

array([15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31,
       32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45])

In [11]:
arr2 = list(reversed(arr1))
arr2

[45,
 44,
 43,
 42,
 41,
 40,
 39,
 38,
 37,
 36,
 35,
 34,
 33,
 32,
 31,
 30,
 29,
 28,
 27,
 26,
 25,
 24,
 23,
 22,
 21,
 20,
 19,
 18,
 17,
 16,
 15]

In [12]:
arr1 = np.random.randint(10,20,size=(2,2))
print("Arr1 :\n",arr1)
arr2 = np.random.randint(30,40,size=(2,2))
print("Arr2 :\n",arr2)

Arr1 :
 [[10 11]
 [18 17]]
Arr2 :
 [[34 34]
 [30 37]]

In [13]:
add1 = arr1 + arr2
add1

array([[44, 45],
       [48, 54]])

In [14]:
sub1 = arr1 - arr2
sub1

array([[-24, -23],
       [-12, -20]])

In [15]:
arr1 = np.array([1.3,1.8,2.3,3.9,1,4,1.9,9,.3])
arr1.round()

array([1., 2., 2., 4., 1., 4., 2., 9., 0.])

In [16]:
import math
np.floor(arr1)

array([1., 1., 2., 3., 1., 4., 1., 9., 0.])

In [17]:
np.ceil(arr1)

array([2., 2., 3., 4., 1., 4., 2., 9., 1.])

In [18]:
arr1 = np.array([[1,2,3],[4,5,6],[7,8,9]])
print("Arr1 :\n",arr1)
result = np.mean(arr1,axis=1)
print("Mean across row>>",result)
result = np.mean(arr1,axis=0)
print("Mean across col>>",result)

Arr1 :
 [[1 2 3]
 [4 5 6]
 [7 8 9]]
Mean across row>> [2. 5. 8.]
Mean across col>> [4. 5. 6.]

In [19]:
list1 = [0,30,45,60,90]
result = np.deg2rad(list1)
result

array([0.        , 0.52359878, 0.78539816, 1.04719755, 1.57079633])

In [20]:
list1 = [0,30,45,60,90]
result = np.deg2rad(list1)
result

array([0.        , 0.52359878, 0.78539816, 1.04719755, 1.57079633])

In [21]:
arr1 = np.random.randint(0,8,size=(3,3))
arr1

array([[6, 2, 2],
       [4, 0, 6],
       [3, 1, 3]])

In [22]:
arr1 = np.random.randint(1,10,size=(2,2))
print("Arr1:\n",arr1)
arr1[:: , ::-1]

Arr1:
 [[4 9]
 [6 4]]

array([[9, 4],
       [4, 6]])

In [23]:
arr1 = np.random.randint(1,10,size=(2,2))
print("Arr1:\n",arr1)
arr1[:: , ::-1]

Arr1:
 [[6 5]
 [1 6]]

array([[5, 6],
       [6, 1]])

In [24]:
arr1 = np.random.randint(1,10,size=(2,2))
print("Arr1:\n",arr1)
arr1[::-1]

Arr1:
 [[3 1]
 [8 4]]

array([[8, 4],
       [3, 1]])

In [25]:
arr1 = np.random.randint(1,10,size=(2,2))
print("Arr1:\n",arr1)
arr1[::-1]

Arr1:
 [[6 8]
 [2 5]]

array([[2, 5],
       [6, 8]])

In [26]:
arr1 = np.array([1,2,0,0,4,0])
print("Arr1:\n",arr1)
result = np.nonzero(arr1)
result

Arr1:
 [1 2 0 0 4 0]

(array([0, 1, 4], dtype=int64),)

In [27]:
arr1 = np.array([1,2,0,0,4,0])
print("Arr1:\n",arr1)
result = np.nonzero(arr1)
result

Arr1:
 [1 2 0 0 4 0]

(array([0, 1, 4], dtype=int64),)

In [28]:
arr1 = np.array([[1,2],[3,4]])
print("Matrix :\n",arr1)
result = np.linalg.det(arr1)
print("Determinant of array:",result)

Matrix :
 [[1 2]
 [3 4]]
Determinant of array: -2.0000000000000004

In [29]:
arr1 = np.array([[1,2],[3,4]])
print("Matrix :\n",arr1)
result = np.linalg.det(arr1)
result

Matrix :
 [[1 2]
 [3 4]]

-2.0000000000000004

In [30]:
arr1 = np.array([[1,2],[3,4]])
print("Matrix :\n",arr1)
result = np.linalg.inv(arr1)
result

Matrix :
 [[1 2]
 [3 4]]

array([[-2. ,  1. ],
       [ 1.5, -0.5]])

In [31]:
arr1 = np.random.randint(1,10,size=(30))
print("Matrix :\n",arr1)
result = np.mean(arr1)
print("Mean of the matrix :\n",result)

Matrix :
 [8 1 2 2 5 5 6 2 4 4 8 5 8 1 1 5 4 9 1 3 7 9 6 1 9 2 8 6 2 4]
Mean of the matrix :
 4.6

In [32]:
arr1 = np.array([1,2,3,4,5,6,7,8,9,10])
print("Array:",arr1)
arr2 = np.where(arr1 > 5)
print("Array:",arr2)

Array: [ 1  2  3  4  5  6  7  8  9 10]
Array: (array([5, 6, 7, 8, 9], dtype=int64),)

In [33]:
arr1 = np.array([1,2,3,4,5,6,7,8,9,10])
print("Array:",arr1)
arr2 = np.where(arr1 < 5)
print("Array:",arr2)

Array: [ 1  2  3  4  5  6  7  8  9 10]
Array: (array([0, 1, 2, 3], dtype=int64),)

In [34]:
arr1 = np.random.random((3,3,3))
print("Array:",arr1)

Array: [[[4.88730569e-01 3.56920829e-01 2.42508392e-01]
  [4.48107414e-01 8.75485443e-01 3.56541022e-01]
  [3.66713683e-01 8.64307399e-01 5.25285292e-01]]

 [[1.98871362e-01 4.25587139e-02 2.72575545e-01]
  [1.31645416e-01 3.22192513e-01 5.48046993e-01]
  [8.04453197e-01 8.37471190e-01 9.17871152e-01]]

 [[6.26342125e-04 7.11731560e-01 1.86533896e-01]
  [7.95319527e-04 4.38964339e-01 1.23020702e-01]
  [6.88349708e-01 8.68910752e-01 2.28603141e-01]]]

In [35]:
arr1 = np.random.rand(10,10)
print("Array:",arr1)
print("Maximum value:",np.max(arr1))
print("Minimum value:",np.min(arr1))

Array: [[0.25965574 0.51770866 0.63893896 0.31347077 0.99650565 0.0413454
  0.39819474 0.88668732 0.46072776 0.17925184]
 [0.73728531 0.351814   0.32322639 0.73513073 0.41387135 0.2859403
  0.02291473 0.07483628 0.06943104 0.02348703]
 [0.86353857 0.42612635 0.78538235 0.14394091 0.28311185 0.41581987
  0.53537867 0.3714331  0.4910455  0.12789041]
 [0.4929332  0.260212   0.1530795  0.1200643  0.10434506 0.39551414
  0.68099764 0.48991928 0.49070387 0.44787651]
 [0.14597504 0.49228198 0.2915735  0.74903079 0.17378252 0.53644506
  0.0367095  0.1231189  0.84864917 0.35036779]
 [0.83885625 0.23851014 0.51414978 0.88038408 0.32392845 0.11952261
  0.50097429 0.94804642 0.55159519 0.05196317]
 [0.72878295 0.88408639 0.77008209 0.39398151 0.18763577 0.01197499
  0.46362106 0.48443059 0.32134804 0.87093931]
 [0.17964001 0.0385772  0.13704649 0.34902469 0.76342317 0.88773951
  0.21709451 0.46625983 0.92969878 0.70342206]
 [0.71991313 0.75806838 0.63018562 0.54003414 0.30474644 0.25206373
  0.30610374 0.3586555  0.92107333 0.53033144]
 [0.40445422 0.42565643 0.54869667 0.7323774  0.53367521 0.21219133
  0.87858466 0.69359502 0.63040953 0.3872545 ]]
Maximum value: 0.996505650324972
Minimum value: 0.011974994376253267

In [36]:
arr1 = np.ones((10,10))
arr1[1:-1, 1:-1] = 0 
arr1

array([[1., 1., 1., 1., 1., 1., 1., 1., 1., 1.],
       [1., 0., 0., 0., 0., 0., 0., 0., 0., 1.],
       [1., 0., 0., 0., 0., 0., 0., 0., 0., 1.],
       [1., 0., 0., 0., 0., 0., 0., 0., 0., 1.],
       [1., 0., 0., 0., 0., 0., 0., 0., 0., 1.],
       [1., 0., 0., 0., 0., 0., 0., 0., 0., 1.],
       [1., 0., 0., 0., 0., 0., 0., 0., 0., 1.],
       [1., 0., 0., 0., 0., 0., 0., 0., 0., 1.],
       [1., 0., 0., 0., 0., 0., 0., 0., 0., 1.],
       [1., 1., 1., 1., 1., 1., 1., 1., 1., 1.]])

In [37]:
arr1 = np.ones((10,10))
arr1[1:-1,1:-1] = 0 
arr1

array([[1., 1., 1., 1., 1., 1., 1., 1., 1., 1.],
       [1., 0., 0., 0., 0., 0., 0., 0., 0., 1.],
       [1., 0., 0., 0., 0., 0., 0., 0., 0., 1.],
       [1., 0., 0., 0., 0., 0., 0., 0., 0., 1.],
       [1., 0., 0., 0., 0., 0., 0., 0., 0., 1.],
       [1., 0., 0., 0., 0., 0., 0., 0., 0., 1.],
       [1., 0., 0., 0., 0., 0., 0., 0., 0., 1.],
       [1., 0., 0., 0., 0., 0., 0., 0., 0., 1.],
       [1., 0., 0., 0., 0., 0., 0., 0., 0., 1.],
       [1., 1., 1., 1., 1., 1., 1., 1., 1., 1.]])

In [38]:
arr1 = np.ones((10,10))
arr1[1:-1,1:-1] = 0 
arr1

array([[1., 1., 1., 1., 1., 1., 1., 1., 1., 1.],
       [1., 0., 0., 0., 0., 0., 0., 0., 0., 1.],
       [1., 0., 0., 0., 0., 0., 0., 0., 0., 1.],
       [1., 0., 0., 0., 0., 0., 0., 0., 0., 1.],
       [1., 0., 0., 0., 0., 0., 0., 0., 0., 1.],
       [1., 0., 0., 0., 0., 0., 0., 0., 0., 1.],
       [1., 0., 0., 0., 0., 0., 0., 0., 0., 1.],
       [1., 0., 0., 0., 0., 0., 0., 0., 0., 1.],
       [1., 0., 0., 0., 0., 0., 0., 0., 0., 1.],
       [1., 1., 1., 1., 1., 1., 1., 1., 1., 1.]])

In [39]:
arr1 = np.zeros((5,5),dtype=int)
np.fill_diagonal(arr1[1:],[1,2,3,4])
arr1

array([[0, 0, 0, 0, 0],
       [1, 0, 0, 0, 0],
       [0, 2, 0, 0, 0],
       [0, 0, 3, 0, 0],
       [0, 0, 0, 4, 0]])

In [40]:
arr1 = np.zeros((5,5),dtype=int)
print(arr1)
np.fill_diagonal(arr1[1:],[1,2,3,4])
arr1

[[0 0 0 0 0]
 [0 0 0 0 0]
 [0 0 0 0 0]
 [0 0 0 0 0]
 [0 0 0 0 0]]

array([[0, 0, 0, 0, 0],
       [1, 0, 0, 0, 0],
       [0, 2, 0, 0, 0],
       [0, 0, 3, 0, 0],
       [0, 0, 0, 4, 0]])

In [41]:
arr1 = np.eye(3,3)
arr1

array([[1., 0., 0.],
       [0., 1., 0.],
       [0., 0., 1.]])

In [42]:
arr1 = np.eye(4,4)
arr1

array([[1., 0., 0., 0.],
       [0., 1., 0., 0.],
       [0., 0., 1., 0.],
       [0., 0., 0., 1.]])

In [43]:
arr1 = np.random.randint(1,9,size=(5,3))
arr2 = np.random.randint(1,9,size=(3,2))
result = np.dot(arr1, arr2)
result

array([[ 43,  99],
       [ 41, 100],
       [ 39,  90],
       [ 26,  59],
       [ 29,  72]])

In [44]:
result = np.dot(arr1,arr2)
result

array([[ 43,  99],
       [ 41, 100],
       [ 39,  90],
       [ 26,  59],
       [ 29,  72]])

In [46]:
arr1 = np.array([1,2,3,4,5,6,7,8,44,9,33,6,5,10])
arr1[(arr1 >= 3) & (arr1 <= 8)] *= -1
arr1

array([ 1,  2, -3, -4, -5, -6, -7, -8, 44,  9, 33, -6, -5, 10])

In [47]:
arr1 = np.array([1,2,3,4,5,6,7,8,44,9,33,6,5,10])
print(arr1)
arr1[(arr1 >= 3) & (arr1 <= 8)] *= -1
arr1

[ 1  2  3  4  5  6  7  8 44  9 33  6  5 10]

array([ 1,  2, -3, -4, -5, -6, -7, -8, 44,  9, 33, -6, -5, 10])

In [48]:
arr1 = np.array([1,2,3,4,5,6,7,8,44,9,33,6,5,10])
result = np.where((arr1 >= 3) & (arr1 <= 8) , -1*arr1 , arr1)
result

array([ 1,  2, -3, -4, -5, -6, -7, -8, 44,  9, 33, -6, -5, 10])

In [49]:
arr1 = np.array([1,2,3,4,5,6,7,8,44,9,33,6,5,10])
result = np.where((arr1 >= 3) & (arr1 <= 8) , -1*arr1 , arr1)
result

array([ 1,  2, -3, -4, -5, -6, -7, -8, 44,  9, 33, -6, -5, 10])

In [50]:
arr1 = np.array([[1.215413,2.654139],[3.4513056,5.2141555]])
print("Matrix :\n", arr1)
result = np.around(arr1)
result

Matrix :
 [[1.215413  2.654139 ]
 [3.4513056 5.2141555]]

array([[1., 3.],
       [3., 5.]])

In [51]:
result = np.ceil(arr1)
result

array([[2., 3.],
       [4., 6.]])

In [52]:
result = np.floor(arr1)
result

array([[1., 2.],
       [3., 5.]])

In [53]:
arr1 = np.array([1,2,3,4,5,6])
arr2 = np.array([4,5,6,7,8,9])
result = np.intersect1d(arr1, arr2)
result

array([4, 5, 6])

In [54]:
arr1 = np.array([1,2,3,4,5,6])
arr2 = np.array([4,5,6,7,8,9])
result = np.intersect1d(arr1, arr2)
result

array([4, 5, 6])

In [55]:
arr1 = np.linspace(0,1,10)[1:-1]
arr1

array([0.11111111, 0.22222222, 0.33333333, 0.44444444, 0.55555556,
       0.66666667, 0.77777778, 0.88888889])

In [56]:
arr1 = np.linspace(0,1,10)[1:-1]
arr1

array([0.11111111, 0.22222222, 0.33333333, 0.44444444, 0.55555556,
       0.66666667, 0.77777778, 0.88888889])

In [57]:
arr1 = np.random.randint(1,10,size=10)
print("Array:",arr1)
result = np.sort(arr1)
result

Array: [1 1 3 1 4 5 4 7 9 3]

array([1, 1, 1, 3, 3, 4, 4, 5, 7, 9])

In [58]:
arr1 = np.zeros((5,5))
print("Original array:\n",arr1)
result = arr1 + np.arange(5)
result

Original array:
 [[0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0.]]

array([[0., 1., 2., 3., 4.],
       [0., 1., 2., 3., 4.],
       [0., 1., 2., 3., 4.],
       [0., 1., 2., 3., 4.],
       [0., 1., 2., 3., 4.]])

In [59]:
arr1 = np.zeros((5,5))
print("Original array:\n",arr1)
result = arr1 + np.arange(5)
result

Original array:
 [[0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0.]]

array([[0., 1., 2., 3., 4.],
       [0., 1., 2., 3., 4.],
       [0., 1., 2., 3., 4.],
       [0., 1., 2., 3., 4.],
       [0., 1., 2., 3., 4.]])

In [60]:
arr1 = np.random.randint(0,5,size=5)
arr2 = np.random.randint(0,5,size=5)
if np.equal == True:
    print("Both arrays are equal")
else:
    print("Both arrays are not equal")

Both arrays are not equal

In [61]:
arr1 = np.random.randint(0,5,size=5)
arr2 = np.random.randint(0,5,size=5)
if np.equal == True:
    print("Both arrays are equal")
else:
    print("Both arrays are not equal")

Both arrays are not equal

In [62]:
arr1 = np.random.randint(0,5,size=5)
arr2 = np.random.randint(0,5,size=5)
result = np.allclose(arr1,arr2)
result

False

In [63]:
arr1 = np.random.randint(0,5,size=5)
arr2 = np.random.randint(0,5,size=5)
result = np.allclose(arr1,arr2)
result

False

In [64]:
arr1 = np.random.randint(1,10,size=10)
print("Array:",arr1)
result = np.where((arr1 >= np.max(arr1)) , 0 , arr1)
result

Array: [4 7 1 6 2 9 4 3 8 6]

array([4, 7, 1, 6, 2, 0, 4, 3, 8, 6])

In [66]:
arr1 = np.random.randint(1,10,size=10)
print("Array:",arr1)
result = np.where((arr1 >= np.max(arr1)),0,arr1)
result

Array: [7 9 7 6 7 9 3 8 8 5]

array([7, 0, 7, 6, 7, 0, 3, 8, 8, 5])

In [67]:
arr1 = np.array([[[1,2,3],[4,5,6],[7,8,9]]])
print("Array:\n",arr1)
for i in np.nditer(arr1):
    print(i , end=" ")

Array:
 [[[1 2 3]
  [4 5 6]
  [7 8 9]]]
1 2 3 4 5 6 7 8 9

In [68]:
arr1 = np.array([[[1,2,3],[4,5,6],[7,8,9]]])
print("Array:\n",arr1)
for i in np.nditer(arr1):
    print(i , end=" ")

Array:
 [[[1 2 3]
  [4 5 6]
  [7 8 9]]]
1 2 3 4 5 6 7 8 9

In [69]:
arr1 = np.array([[1,2,3],[4,5,6],[7,8,9]])
print("Array:\n",arr1)
for index,value in np.ndenumerate(arr1):
    print(f"{index} index has {value} values")

Array:
 [[1 2 3]
 [4 5 6]
 [7 8 9]]
(0, 0) index has 1 values
(0, 1) index has 2 values
(0, 2) index has 3 values
(1, 0) index has 4 values
(1, 1) index has 5 values
(1, 2) index has 6 values
(2, 0) index has 7 values
(2, 1) index has 8 values
(2, 2) index has 9 values

In [70]:
arr1 = np.array([[1,2,3],[4,5,6],[7,8,9]])
print("Array:\n",arr1)
for index,value in np.ndenumerate(arr1):
    print(f"{index} index has {value} values")

Array:
 [[1 2 3]
 [4 5 6]
 [7 8 9]]
(0, 0) index has 1 values
(0, 1) index has 2 values
(0, 2) index has 3 values
(1, 0) index has 4 values
(1, 1) index has 5 values
(1, 2) index has 6 values
(2, 0) index has 7 values
(2, 1) index has 8 values
(2, 2) index has 9 values

In [71]:
arr1 = np.random.randint(1,10,size=(3,3))
print("Array:\n",arr1)
result = (arr1[arr1[:,2].argsort()])
result

Array:
 [[1 2 1]
 [2 3 8]
 [1 5 7]]

array([[1, 2, 1],
       [1, 5, 7],
       [2, 3, 8]])

In [72]:
arr1 = np.random.randint(1,10,size=(3,3))
print("Array:\n",arr1)
result = (arr1[arr1[:,2].argsort()])
result

Array:
 [[6 2 6]
 [6 2 2]
 [6 5 5]]

array([[6, 2, 2],
       [6, 5, 5],
       [6, 2, 6]])

In [73]:
arr1 = np.array([[4,3,1],[5,8,9],[3,4,5]])
print("Array:\n",arr1)
arr1[[0,2]] = arr1[[2,0]]
arr1

Array:
 [[4 3 1]
 [5 8 9]
 [3 4 5]]

array([[3, 4, 5],
       [5, 8, 9],
       [4, 3, 1]])

In [74]:
arr1 = np.array([[4,3,1],[5,8,9],[3,4,5]])
print("Array:\n",arr1)
arr1[[0,2]] = arr1[[2,0]]
arr1

Array:
 [[4 3 1]
 [5 8 9]
 [3 4 5]]

array([[3, 4, 5],
       [5, 8, 9],
       [4, 3, 1]])

In [75]:
from scipy.stats import mode
arr1 = np.array([1,2,3,4,5,6,7,8,9,10])
print("Array:\n",arr1)
result = mode(arr1)
result

Array:
 [ 1  2  3  4  5  6  7  8  9 10]

ModeResult(mode=1, count=1)

In [76]:
result = np.around(5.4322 , 3)
result

5.432

In [77]:
result = np.around(5.4322 , 2)
result

5.43

In [78]:
arr1 = np.array([[2,3],[3,4]])
result = np.linalg.inv(arr1)
result

array([[-4.,  3.],
       [ 3., -2.]])

In [79]:
arr1 = np.array([[2,3],[3,4]])
result = np.cov(arr1)
result

array([[0.5, 0.5],
       [0.5, 0.5]])

In [80]:
x = np.array([1,2,3])
y = np.array([4,5,6])
result = np.cov(x,y)
result

array([[1., 1.],
       [1., 1.]])

In [81]:
arr1 = np.array([1,1,2,2,3,4,5,6,7,8,9,6,4,3,6,7])
result = mode(arr1)[0]
result

6

In [83]:
arr1 = np.array([1,2,3,4,5,6,7,8,9,10])
print("Matrix:\n", arr1)
print("Dimension of the matrix:",arr1.ndim)
arr1.shape
arr2 = np.reshape(arr1,(2,5,1))
print(arr2)
print("Dimension of the array is :",arr2.ndim)

Matrix:
 [ 1  2  3  4  5  6  7  8  9 10]
Dimension of the matrix: 1
[[[ 1]
  [ 2]
  [ 3]
  [ 4]
  [ 5]]

 [[ 6]
  [ 7]
  [ 8]
  [ 9]
  [10]]]
Dimension of the array is : 3

In [84]:
arr1 = np.random.randint(1,10,size=(1,2,3,4))
print(arr1)
arr2 = np.reshape(arr1 , (6,4))
print(arr2)

[[[[4 6 2 6]
   [8 5 7 8]
   [5 8 6 7]]

  [[8 5 7 1]
   [4 3 9 7]
   [3 5 6 3]]]]
[[4 6 2 6]
 [8 5 7 8]
 [5 8 6 7]
 [8 5 7 1]
 [4 3 9 7]
 [3 5 6 3]]

In [85]:
arr1 = np.zeros(10,dtype=int)
arr1

array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0])

In [86]:
arr1 = np.array([[1,2,3,4],[5,6,8,7],[3,4,5,6]])
arr1.shape

(3, 4)

In [1]:
import numpy as np 
import pandas as pd 
s1 = pd.Series([1,2,3,4,5])
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [2]:
list1 = [[1,2,3],[4,5,6]]
df = pd.DataFrame(list1)
df

   0  1  2
0  1  2  3
1  4  5  6

In [3]:
df = pd.DataFrame(columns=list("ABC"),index=list("PQR"))
df

     A    B    C
P  NaN  NaN  NaN
Q  NaN  NaN  NaN
R  NaN  NaN  NaN

In [4]:
df = pd.DataFrame(columns=list("ABC"),index=list("PQR"))
if df.isnull:
    print("Dataframe is empty")
else:
    print("Dataframe is not empty")

Dataframe is empty

In [5]:
arr1 = np.array([[1,2,3],[4,5,6]])
print(arr1)
df = pd.DataFrame(arr1)
df

[[1 2 3]
 [4 5 6]]

   0  1  2
0  1  2  3
1  4  5  6

In [6]:
list1 = [[1,2,3],[4,5,6]]
df = pd.DataFrame(list1)
df

   0  1  2
0  1  2  3
1  4  5  6

In [7]:
tuple1 = (1,2,3,4,5,6)
df = pd.DataFrame(tuple1)
df

   0
0  1
1  2
2  3
3  4
4  5
5  6

In [8]:
dict1 = {"name" : ["hindvi","ovi","rudu"] , "marks" : [80,70,90]}
df = pd.DataFrame(dict1)
df

     name  marks
0  hindvi     80
1     ovi     70
2    rudu     90

In [9]:
l1 = [[1,2,3],[4,5,6],[7,8,9]]
df = pd.DataFrame(l1,columns=list("ABC"))
df

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [10]:
df = pd.DataFrame(np.random.randint(10,40,size=(5,6)))
df

    0   1   2   3   4   5
0  26  28  31  31  26  28
1  37  28  20  35  15  18
2  30  37  21  18  23  22
3  15  14  28  27  12  33
4  35  12  17  27  29  30

In [11]:
arr1 = np.array([[1,2,3],[4,5,6],[7,8,9]])
print(arr1)
df = pd.DataFrame(arr1)
df

[[1 2 3]
 [4 5 6]
 [7 8 9]]

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [12]:
dict1 = {"name" : ["hindvi","ovi","rudu"] , "marks" : [80,70,90]}
df = pd.DataFrame(dict1)
df

     name  marks
0  hindvi     80
1     ovi     70
2    rudu     90

In [14]:
s1 = pd.Series([1,2,3,4,5,6])
s2 = s1.copy()
s2[0] = 50 
print("Original series:\n",s1)
print("Copy series:\n",s2)

Original series:
 0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64
Copy series:
 0    50
1     2
2     3
3     4
4     5
5     6
dtype: int64

In [15]:
df = pd.DataFrame(np.full((4,5),6))
print(df)

   0  1  2  3  4
0  6  6  6  6  6
1  6  6  6  6  6
2  6  6  6  6  6
3  6  6  6  6  6

In [16]:
df["5"] = [1,2,3,4]
df

   0  1  2  3  4  5
0  6  6  6  6  6  1
1  6  6  6  6  6  2
2  6  6  6  6  6  3
3  6  6  6  6  6  4

In [17]:
df.loc[4] = [1,2,3,4,5,4]
df

   0  1  2  3  4  5
0  6  6  6  6  6  1
1  6  6  6  6  6  2
2  6  6  6  6  6  3
3  6  6  6  6  6  4
4  1  2  3  4  5  4

In [18]:
arr1 = np.array([[1,2,3],[4,5,6],[7,8,9]])
df = pd.DataFrame(arr1 , index=list("ABC"))
df

   0  1  2
A  1  2  3
B  4  5  6
C  7  8  9

In [19]:
arr1 = np.random.randint(0,20,size=(4,4))
print(arr1)
df = pd.DataFrame(arr1 , columns=list("ABCD") , index=list("PQRS"))
print(df)

[[13  8 10  6]
 [ 2  7 17  8]
 [13  1  8  3]
 [ 3  0 19  9]]
    A  B   C  D
P  13  8  10  6
Q   2  7  17  8
R  13  1   8  3
S   3  0  19  9

In [20]:
df.rename({"A":"a","B":"b","C":"c","D":"d"},axis=1,inplace=True)
df.rename({"P":"p","Q":"q","R":"r","S":"s"},axis=0,inplace=True)
df

    a  b   c  d
p  13  8  10  6
q   2  7  17  8
r  13  1   8  3
s   3  0  19  9

In [21]:
for i in df.items():
    print(i)

('a', p    13
q     2
r    13
s     3
Name: a, dtype: int32)
('b', p    8
q    7
r    1
s    0
Name: b, dtype: int32)
('c', p    10
q    17
r     8
s    19
Name: c, dtype: int32)
('d', p    6
q    8
r    3
s    9
Name: d, dtype: int32)

In [22]:
for i in df.items():
    print(i)

('a', p    13
q     2
r    13
s     3
Name: a, dtype: int32)
('b', p    8
q    7
r    1
s    0
Name: b, dtype: int32)
('c', p    10
q    17
r     8
s    19
Name: c, dtype: int32)
('d', p    6
q    8
r    3
s    9
Name: d, dtype: int32)

In [23]:
for i in df.iterrows():
    print(i)

('p', a    13
b     8
c    10
d     6
Name: p, dtype: int32)
('q', a     2
b     7
c    17
d     8
Name: q, dtype: int32)
('r', a    13
b     1
c     8
d     3
Name: r, dtype: int32)
('s', a     3
b     0
c    19
d     9
Name: s, dtype: int32)

In [24]:
df

    a  b   c  d
p  13  8  10  6
q   2  7  17  8
r  13  1   8  3
s   3  0  19  9

In [25]:
arr1 = df.values
arr1

array([[13,  8, 10,  6],
       [ 2,  7, 17,  8],
       [13,  1,  8,  3],
       [ 3,  0, 19,  9]])

In [26]:
df

    a  b   c  d
p  13  8  10  6
q   2  7  17  8
r  13  1   8  3
s   3  0  19  9

In [27]:
arr1 = df.values
arr1.tolist()

[[13, 8, 10, 6], [2, 7, 17, 8], [13, 1, 8, 3], [3, 0, 19, 9]]

In [28]:
df

    a  b   c  d
p  13  8  10  6
q   2  7  17  8
r  13  1   8  3
s   3  0  19  9

In [29]:
df.reset_index(drop=True)

    a  b   c  d
0  13  8  10  6
1   2  7  17  8
2  13  1   8  3
3   3  0  19  9

In [30]:
df = pd.DataFrame(np.random.randint(10,20,size=(4,5)))
print(df)
df.shape

    0   1   2   3   4
0  13  13  17  16  17
1  14  17  13  15  16
2  14  18  18  17  10
3  14  17  13  18  10

(4, 5)

In [32]:
s1 = pd.Series(np.arange(50,60))
s2 = pd.Series(np.arange(25,35))
print(s1)
print(s2)
print("Addition of 2 Series:",s1+s2)
print("Subtraction of 2 Series:",s1-s2)
print("Multiplication of 2 Series:\n",s1*s2)
print("Series 1 divide by 2 series:\n",s1/s2)

0    50
1    51
2    52
3    53
4    54
5    55
6    56
7    57
8    58
9    59
dtype: int32
0    25
1    26
2    27
3    28
4    29
5    30
6    31
7    32
8    33
9    34
dtype: int32
Addition of 2 Series: 0    75
1    77
2    79
3    81
4    83
5    85
6    87
7    89
8    91
9    93
dtype: int32
Subtraction of 2 Series: 0    25
1    25
2    25
3    25
4    25
5    25
6    25
7    25
8    25
9    25
dtype: int32
Multiplication of 2 Series:
 0    1250
1    1326
2    1404
3    1484
4    1566
5    1650
6    1736
7    1824
8    1914
9    2006
dtype: int32
Series 1 divide by 2 series:
 0    2.000000
1    1.961538
2    1.925926
3    1.892857
4    1.862069
5    1.833333
6    1.806452
7    1.781250
8    1.757576
9    1.735294
dtype: float64

In [33]:
df = pd.read_excel("Sample1.xlsx")
df

,Unnamed: 0,First Name,Last Name,Gender,Country,Age,Date,Id
0,1,Dulce,Abril,Female,United States,32,15/10/2017,1562
1,2,Mara,Hashimoto,Female,Great Britain,25,16/08/2016,1582
2,3,Philip,Gent,Male,France,36,21/05/2015,2587
3,4,Kathleen,Hanner,Female,United States,25,15/10/2017,3549
4,5,Nereida,Magwood,Female,United States,58,16/08/2016,2468
...,...,...,...,...,...,...,...,...
995,996,Roma,Lafollette,Female,United States,34,15/10/2017,2654
996,997,Felisa,Cail,Female,United States,28,16/08/2016,6525
997,998,Demetria,Abbey,Female,United States,32,21/05/2015,3265
998,999,Jeromy,Danz,Male,United States,39,15/10/2017,3265
999,1000,Rasheeda,Alkire,Female,United States,29,16/08/2016,6125

In [34]:
df[["First Name","Last Name"]]

    First Name   Last Name
0        Dulce       Abril
1         Mara   Hashimoto
2       Philip        Gent
3     Kathleen      Hanner
4      Nereida     Magwood
..         ...         ...
995       Roma  Lafollette
996     Felisa        Cail
997   Demetria       Abbey
998     Jeromy        Danz
999   Rasheeda      Alkire

[1000 rows x 2 columns]

In [35]:
df["Age"].mean()

33.26

In [36]:
df["Age"].sum()

33260

In [37]:
df["Age"].max()

58

In [38]:
df["Age"].min()

21

In [39]:
df = pd.DataFrame(np.random.randint(1,10,size=(5,4)))
print(df)
# df.to_excel("Dataframe.xlsx")

# df.to_csv("Dataframe.csv")

   0  1  2  3
0  3  4  9  9
1  7  6  4  7
2  3  6  6  7
3  3  8  2  3
4  8  9  1  1

In [40]:
df = pd.read_csv("titanic.csv")
df.head(3)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,NaN,0,0,STON/O2. 3101282,7.9250,NaN,S

In [41]:
df.groupby(df["Embarked"]).get_group("S")

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,NaN,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,NaN,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,NaN,0,0,373450,8.0500,NaN,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
...,...,...,...,...,...,...,...,...,...,...,...,...
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [42]:
arr1 = np.random.randint(1,20,size=(4,2))
print(arr1)
df = pd.DataFrame(arr1)
df.apply(np.sqrt)

[[14 15]
 [ 1 15]
 [ 4  3]
 [11  7]]

          0         1
0  3.741657  3.872983
1  1.000000  3.872983
2  2.000000  1.732051
3  3.316625  2.645751

In [43]:
arr1 = np.random.randint(1,20,size=(4,2))
df = pd.DataFrame(arr1)
df.apply(np.sqrt)

          0         1
0  2.828427  4.000000
1  2.000000  3.316625
2  3.316625  2.449490
3  3.605551  4.358899

In [44]:
df = pd.DataFrame(np.random.randint(1,9,size=(3,4)))
df

   0  1  2  3
0  8  2  4  7
1  7  5  5  5
2  5  1  6  2

In [45]:
df.apply(lambda x : x**2)

    0   1   2   3
0  64   4  16  49
1  49  25  25  25
2  25   1  36   4

In [46]:
def cube(x):
    result = x**3
    return result
df.apply(cube)

     0    1    2    3
0  512    8   64  343
1  343  125  125  125
2  125    1  216    8

In [47]:
arr1 = np.random.randint(1,20,size=(4,2))
df = pd.DataFrame(arr1)
print(df)
df.apply(lambda x : x**2)

    0   1
0   7   1
1  12  11
2  17  10
3   7   1

     0    1
0   49    1
1  144  121
2  289  100
3   49    1

In [48]:
df = pd.read_csv("diabetes.csv")
df

,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,148,50,35,0,33.6,0.627,50,1
1,85,66,29,0,26.6,0.351,31,0
2,183,64,0,0,23.3,0.672,52,1
3,150,66,23,94,28.1,0.167,21,0
4,150,40,35,168,43.1,2.288,33,1
...,...,...,...,...,...,...,...,...
763,101,76,48,180,32.9,0.171,63,0
764,122,70,27,0,36.8,0.340,27,0
765,121,72,23,112,26.2,0.245,30,0
766,126,60,0,0,30.1,0.349,47,1
767,93,70,31,0,30.4,0.315,23,0

In [49]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 768 entries, 0 to 767
Data columns (total 8 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Glucose                   768 non-null    int64
 1   BloodPressure             768 non-null    int64
 2   SkinThickness             768 non-null    int64
 3   Insulin                   768 non-null    int64
 4   BMI                       768 non-null    float64
 5   DiabetesPedigreeFunction  768 non-null    float64
 6   Age                       768 non-null    int64
 7   Outcome                   768 non-null    int64
dtypes: float64(2), int64(6)
memory usage: 48.1 KB

In [50]:
df.describe()

,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
count,768.000000,768.000000,768.000000,768.000000,768.000000,768.000000,768.000000,768.000000
mean,121.117188,69.076823,20.536458,79.799479,31.992578,0.471876,33.243490,0.348958
std,31.805091,19.367794,15.952218,115.244002,7.884160,0.331329,11.758182,0.476951
min,0.000000,0.000000,0.000000,0.000000,0.000000,0.078000,21.000000,0.000000
25%,99.000000,62.000000,0.000000,0.000000,27.300000,0.243750,24.000000,0.000000
50%,117.000000,72.000000,23.000000,30.500000,32.000000,0.372500,29.000000,0.000000
75%,142.000000,80.000000,32.000000,127.250000,36.600000,0.626250,41.000000,1.000000
max,199.000000,122.000000,99.000000,846.000000,67.100000,2.420000,81.000000,1.000000

In [51]:
df.head(3)

,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,148,50,35,0,33.6,0.627,50,1
1,85,66,29,0,26.6,0.351,31,0
2,183,64,0,0,23.3,0.672,52,1

In [52]:
df.tail(3)

,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
765,121,72,23,112,26.2,0.245,30,0
766,126,60,0,0,30.1,0.349,47,1
767,93,70,31,0,30.4,0.315,23,0

In [53]:
data1 = {"NAME" : ["Rudranshi","Sanvi","Swati","Shiva"]}
df = pd.DataFrame(data1)
df["NAME"].apply(lambda x : x.istitle())

0    True
1    True
2    True
3    True
Name: NAME, dtype: bool

In [54]:
d1 = {"Employee":["Saniya","Sara","Alexa","Jenny"]}
d2 = {"Saniya": "Software Developer" , "Sara":"Developer" , "Alexa":"Assistant"}
df = pd.DataFrame(d1)
df

  Employee
0   Saniya
1     Sara
2    Alexa
3    Jenny

In [55]:
df["Designation"] = df["Employee"].map(d2)
df

  Employee         Designation
0   Saniya  Software Developer
1     Sara           Developer
2    Alexa           Assistant
3    Jenny                 NaN

In [57]:
arr1 = np.random.randint(1,10,size=(5,5))
print(arr1)
df = pd.DataFrame(arr1 , columns=list("ABCDE"))
df["I"] = [1,2,3,4,5]
df

[[3 4 8 9 6]
 [4 8 8 9 9]
 [3 5 3 4 2]
 [6 7 6 3 4]
 [7 7 1 7 3]]

   A  B  C  D  E  I
0  3  4  8  9  6  1
1  4  8  8  9  9  2
2  3  5  3  4  2  3
3  6  7  6  3  4  4
4  7  7  1  7  3  5

In [58]:
arr1 = np.random.randint(1,10,size=(5,5))
print(arr1)
df = pd.DataFrame(arr1 , columns=list("ABCDE"))
df.insert(1, "H" , [1,2,1,2,1])
df

[[8 2 3 1 9]
 [5 3 9 6 7]
 [1 1 8 2 2]
 [9 1 4 6 6]
 [5 8 2 4 6]]

   A  H  B  C  D  E
0  8  1  2  3  1  9
1  5  2  3  9  6  7
2  1  1  1  8  2  2
3  9  2  1  4  6  6
4  5  1  8  2  4  6

In [59]:
df.drop("A",axis=1,inplace=True)
df

   H  B  C  D  E
0  1  2  3  1  9
1  2  3  9  6  7
2  1  1  8  2  2
3  2  1  4  6  6
4  1  8  2  4  6

In [64]:
df.drop(2,axis=0,inplace=True)
df

KeyError: '[2] not found in axis'

In [65]:
s1 = pd.Series([1,2,3,4,5])
s2 = pd.Series([4,5,6,7,8])
s11 = set(s1)
s22 = set(s2)
result = s11.symmetric_difference(s22)
result

{1, 2, 3, 6, 7, 8}

In [66]:
s1 = pd.Series([1,2,3,4,5])
s2 = pd.Series([4,5,6,7,8])
s11 = set(s1)
s22 = set(s2)
result = s11.symmetric_difference(s22)
result

{1, 2, 3, 6, 7, 8}

In [67]:
s1 = pd.Series([1,2,3,4,5])
print("Median:",s1.median())
print("Minumum:",s1.min())
print("25th percentile:",s1.quantile(0.25))
print("75th percentile:",s1.quantile(0.75))
print("Maximum:",s1.max())

Median: 3.0
Minumum: 1
25th percentile: 2.0
75th percentile: 4.0
Maximum: 5

In [68]:
df = pd.DataFrame(np.random.randint(10,50,size=(4,4)),columns=list("CABD"),index=list("xzvs"))
df

    C   A   B   D
x  41  16  13  21
z  27  37  12  34
v  32  47  13  43
s  33  45  10  13

In [69]:
df.sort_index()

    C   A   B   D
s  33  45  10  13
v  32  47  13  43
x  41  16  13  21
z  27  37  12  34

In [70]:
df.sort_index(axis=1)

    A   B   C   D
x  16  13  41  21
z  37  12  27  34
v  47  13  32  43
s  45  10  33  13

In [71]:
df.sort_values("D")

    C   A   B   D
s  33  45  10  13
x  41  16  13  21
z  27  37  12  34
v  32  47  13  43

In [72]:
df = pd.DataFrame({"A" : [1,1,3,4,5],
                   "B" : [1,1,3,4,5],
                   "C" : [1,1,3,4,5],
                   "D" : [1,1,3,4,5]})
df

   A  B  C  D
0  1  1  1  1
1  1  1  1  1
2  3  3  3  3
3  4  4  4  4
4  5  5  5  5

In [73]:
df.drop_duplicates()

   A  B  C  D
0  1  1  1  1
2  3  3  3  3
3  4  4  4  4
4  5  5  5  5

In [74]:
df.drop("A",axis=1,inplace=True)

In [75]:
df

   B  C  D
0  1  1  1
1  1  1  1
2  3  3  3
3  4  4  4
4  5  5  5

In [76]:
data = {'Full Name': ['John Doe', 'Jane Smith', 'Bob Johnson']}
df = pd.DataFrame(data)
df

     Full Name
0     John Doe
1   Jane Smith
2  Bob Johnson

In [77]:
df[["First Name","Last Name"]] = df["Full Name"].str.split(expand=True)
df

     Full Name First Name Last Name
0     John Doe       John       Doe
1   Jane Smith       Jane     Smith
2  Bob Johnson        Bob   Johnson

In [2]:
import pandas as pd 
import numpy as np
df = pd.read_csv("titanic.csv")
df.head(3)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,NaN,0,0,STON/O2. 3101282,7.9250,NaN,S

In [3]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Gender           0
Age            180
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [4]:
df["Age"].fillna(df["Age"].mean(),inplace=True)
df["Age"].isna().sum()

0

In [5]:
movie_dict = {"Movies":["Interstellar","Avengers","Dhoom","Interstellar"],
"Genre":["fiction","Fiction","Comedy","fiction"],
"Actors":["American","French","Indian","American"]}
index_labels = ["a","b","c","d"]
df = pd.DataFrame(movie_dict,index_labels)
df

         Movies    Genre    Actors
a  Interstellar  fiction  American
b      Avengers  Fiction    French
c         Dhoom   Comedy    Indian
d  Interstellar  fiction  American

In [6]:
movie_dict = {"Movies":["Interstellar","Avengers","Dhoom","Interstellar"],
"Genre":["fiction","Fiction","Comedy","fiction"],
"Actors":["American","French","Indian","American"]}
index_labels = ["a","b","c","d"]
df = pd.DataFrame(movie_dict , index_labels)
df

         Movies    Genre    Actors
a  Interstellar  fiction  American
b      Avengers  Fiction    French
c         Dhoom   Comedy    Indian
d  Interstellar  fiction  American

In [7]:
df

         Movies    Genre    Actors
a  Interstellar  fiction  American
b      Avengers  Fiction    French
c         Dhoom   Comedy    Indian
d  Interstellar  fiction  American

In [8]:
df.head(2)

         Movies    Genre    Actors
a  Interstellar  fiction  American
b      Avengers  Fiction    French

In [9]:
df = pd.read_csv("titanic.csv")
df

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,NaN,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,NaN,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,NaN,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [10]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Gender', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [11]:
df.loc[[0,1,2,3] , ["Name","Gender"]]

                                                Name  Gender
0                            Braund, Mr. Owen Harris    male
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female
2                             Heikkinen, Miss. Laina  female
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female

In [12]:
df.head(2)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [13]:
df.isna()

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,True,False,False,False,False,True,False
3,False,False,False,False,False,True,False,False,False,False,False,False
4,False,False,False,False,False,True,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,True,False
887,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,True,False,False,False,False,True,False
889,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,True,False

In [15]:
df.isna().sum().to_dict()

{'PassengerId': 0,
 'Survived': 0,
 'Pclass': 0,
 'Name': 0,
 'Gender': 0,
 'Age': 180,
 'SibSp': 0,
 'Parch': 0,
 'Ticket': 0,
 'Fare': 0,
 'Cabin': 687,
 'Embarked': 2}

In [16]:
df.isnull().sum().to_dict()

{'PassengerId': 0,
 'Survived': 0,
 'Pclass': 0,
 'Name': 0,
 'Gender': 0,
 'Age': 180,
 'SibSp': 0,
 'Parch': 0,
 'Ticket': 0,
 'Fare': 0,
 'Cabin': 687,
 'Embarked': 2}

In [17]:
df.head(2)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [18]:
df.dropna()

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
21,22,1,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,13.0000,D56,S
...,...,...,...,...,...,...,...,...,...,...,...,...
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

In [19]:
df.isnull().sum().to_dict()

{'PassengerId': 0,
 'Survived': 0,
 'Pclass': 0,
 'Name': 0,
 'Gender': 0,
 'Age': 180,
 'SibSp': 0,
 'Parch': 0,
 'Ticket': 0,
 'Fare': 0,
 'Cabin': 687,
 'Embarked': 2}

In [21]:
df.dropna(inplace=True)

In [22]:
df.isnull().sum().to_dict()

{'PassengerId': 0,
 'Survived': 0,
 'Pclass': 0,
 'Name': 0,
 'Gender': 0,
 'Age': 0,
 'SibSp': 0,
 'Parch': 0,
 'Ticket': 0,
 'Fare': 0,
 'Cabin': 0,
 'Embarked': 0}

In [23]:
df = pd.read_csv("titanic.csv")
df.head(2)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [24]:
df.isna().sum().to_dict()

{'PassengerId': 0,
 'Survived': 0,
 'Pclass': 0,
 'Name': 0,
 'Gender': 0,
 'Age': 180,
 'SibSp': 0,
 'Parch': 0,
 'Ticket': 0,
 'Fare': 0,
 'Cabin': 687,
 'Embarked': 2}

In [26]:
df["Age"].fillna(40,inplace=True)
df.isna().sum().to_dict()

{'PassengerId': 0,
 'Survived': 0,
 'Pclass': 0,
 'Name': 0,
 'Gender': 0,
 'Age': 0,
 'SibSp': 0,
 'Parch': 0,
 'Ticket': 0,
 'Fare': 0,
 'Cabin': 687,
 'Embarked': 2}

In [27]:
df = pd.read_csv("titanic.csv")
df.head(2)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [28]:
df["Age"].fillna(df["Age"].median(),inplace=True)
df.isna().sum().to_dict()

{'PassengerId': 0,
 'Survived': 0,
 'Pclass': 0,
 'Name': 0,
 'Gender': 0,
 'Age': 0,
 'SibSp': 0,
 'Parch': 0,
 'Ticket': 0,
 'Fare': 0,
 'Cabin': 687,
 'Embarked': 2}

In [29]:
df = pd.read_csv("titanic.csv")
df.head(2)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [30]:
print("Nan values present in Age Feature at indexes:\n",df["Age"].isna().to_numpy().nonzero())

Nan values present in Age Feature at indexes:
 (array([  2,   3,   4,   5,  17,  19,  26,  28,  29,  31,  32,  36,  42,
        45,  46,  47,  48,  55,  64,  65,  76,  77,  82,  87,  95, 101,
       107, 109, 121, 126, 128, 140, 154, 158, 159, 166, 168, 176, 180,
       181, 185, 186, 196, 198, 201, 214, 223, 229, 235, 240, 241, 250,
       256, 260, 264, 270, 274, 277, 284, 295, 298, 300, 301, 303, 304,
       306, 324, 330, 334, 335, 347, 351, 354, 358, 359, 364, 367, 368,
       375, 384, 388, 409, 410, 411, 413, 415, 420, 425, 428, 431, 444,
       451, 454, 457, 459, 464, 466, 468, 470, 475, 481, 485, 490, 495,
       497, 502, 507, 511, 517, 522, 524, 527, 531, 533, 538, 547, 552,
       557, 560, 563, 564, 568, 573, 578, 584, 589, 593, 596, 598, 601,
       602, 611, 612, 613, 629, 633, 639, 643, 648, 650, 653, 656, 667,
       669, 674, 680, 692, 697, 709, 711, 718, 727, 732, 738, 739, 740,
       760, 766, 768, 773, 776, 778, 783, 790, 792, 793, 815, 825, 826,
       828, 832, 837, 839, 846, 849, 859, 863, 868, 878, 888], dtype=int64),)

In [31]:
df["Age"].isna().to_numpy().nonzero()

(array([  2,   3,   4,   5,  17,  19,  26,  28,  29,  31,  32,  36,  42,
         45,  46,  47,  48,  55,  64,  65,  76,  77,  82,  87,  95, 101,
        107, 109, 121, 126, 128, 140, 154, 158, 159, 166, 168, 176, 180,
        181, 185, 186, 196, 198, 201, 214, 223, 229, 235, 240, 241, 250,
        256, 260, 264, 270, 274, 277, 284, 295, 298, 300, 301, 303, 304,
        306, 324, 330, 334, 335, 347, 351, 354, 358, 359, 364, 367, 368,
        375, 384, 388, 409, 410, 411, 413, 415, 420, 425, 428, 431, 444,
        451, 454, 457, 459, 464, 466, 468, 470, 475, 481, 485, 490, 495,
        497, 502, 507, 511, 517, 522, 524, 527, 531, 533, 538, 547, 552,
        557, 560, 563, 564, 568, 573, 578, 584, 589, 593, 596, 598, 601,
        602, 611, 612, 613, 629, 633, 639, 643, 648, 650, 653, 656, 667,
        669, 674, 680, 692, 697, 709, 711, 718, 727, 732, 738, 739, 740,
        760, 766, 768, 773, 776, 778, 783, 790, 792, 793, 815, 825, 826,
        828, 832, 837, 839, 846, 849, 859, 863, 868, 878, 888], dtype=int64),)

In [32]:
df = pd.read_csv("titanic.csv")
df.head(2)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [33]:
female = df.groupby(df["Gender"]).get_group("female")
female

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,NaN,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,NaN,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [34]:
s = df.groupby(df["Embarked"]).get_group("S")
s

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,NaN,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,NaN,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,NaN,0,0,373450,8.0500,NaN,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
...,...,...,...,...,...,...,...,...,...,...,...,...
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [35]:
df

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,NaN,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,NaN,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,NaN,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [36]:
df = pd.read_csv("diabetes.csv")
df

,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,148,50,35,0,33.6,0.627,50,1
1,85,66,29,0,26.6,0.351,31,0
2,183,64,0,0,23.3,0.672,52,1
3,150,66,23,94,28.1,0.167,21,0
4,150,40,35,168,43.1,2.288,33,1
...,...,...,...,...,...,...,...,...
763,101,76,48,180,32.9,0.171,63,0
764,122,70,27,0,36.8,0.340,27,0
765,121,72,23,112,26.2,0.245,30,0
766,126,60,0,0,30.1,0.349,47,1
767,93,70,31,0,30.4,0.315,23,0

In [37]:
df.loc[: , ["Age","Outcome","BMI","Glucose"]]

     Age  Outcome   BMI  Glucose
0     50        1  33.6      148
1     31        0  26.6       85
2     52        1  23.3      183
3     21        0  28.1      150
4     33        1  43.1      150
..   ...      ...   ...      ...
763   63        0  32.9      101
764   27        0  36.8      122
765   30        0  26.2      121
766   47        1  30.1      126
767   23        0  30.4       93

[768 rows x 4 columns]

In [38]:
df.reindex(["Age","Outcome","BMI"],axis=1)

     Age  Outcome   BMI
0     50        1  33.6
1     31        0  26.6
2     52        1  23.3
3     21        0  28.1
4     33        1  43.1
..   ...      ...   ...
763   63        0  32.9
764   27        0  36.8
765   30        0  26.2
766   47        1  30.1
767   23        0  30.4

[768 rows x 3 columns]

In [39]:
df = pd.read_csv("student.csv")
df

    id         name  class  mark  gender
0    1     John Deo   Four    75  female
1    2     Max Ruin  Three    85    male
2    3       Arnold  Three    55    male
3    4   Krish Star   Four    60  female
4    5    John Mike   Four    60  female
5    6    Alex John   Four    55    male
6    7  My John Rob  Fifth    78    male
7    8       Asruid   Five    85    male
8    9      Tes Qry    Six    78    male
9   10     Big John   Four    55  female
10  11       Ronald    Six    89  female
11  12        Recky    Six    94  female
12  13          Kty  Seven    88  female
13  14         Bigy  Seven    88  female
14  15     Tade Row   Four    88    male
15  16        Gimmy   Four    88    male
16  17        Tumyu    Six    54    male
17  18        Honny   Five    75    male
18  19        Tinny   Nine    18    male
19  20       Jackly   Nine    65  female
20  21   Babby John   Four    69  female
21  22       Reggid  Seven    55  female
22  23        Herod  Eight    79    male
23  24    Tiddy Now  Seven    78    male
24  25     Giff Tow  Seven    88    male
25  26       Crelea  Seven    79    male
26  27     Big Nose  Three    81  female
27  28    Rojj Base  Seven    86  female
28  29  Tess Played  Seven    55    male
29  30    Reppy Red    Six    79  female
30  31  Marry Toeey   Four    88    male
31  32    Binn Rott  Seven    90  female
32  33    Kenn Rein    Six    96  female
33  34     Gain Toe  Seven    69    male
34  35   Rows Noump    Six    88  female

In [40]:
df.loc[35] = [36,"Abhishek","five",45,"male"]
df

    id         name  class  mark  gender
0    1     John Deo   Four    75  female
1    2     Max Ruin  Three    85    male
2    3       Arnold  Three    55    male
3    4   Krish Star   Four    60  female
4    5    John Mike   Four    60  female
5    6    Alex John   Four    55    male
6    7  My John Rob  Fifth    78    male
7    8       Asruid   Five    85    male
8    9      Tes Qry    Six    78    male
9   10     Big John   Four    55  female
10  11       Ronald    Six    89  female
11  12        Recky    Six    94  female
12  13          Kty  Seven    88  female
13  14         Bigy  Seven    88  female
14  15     Tade Row   Four    88    male
15  16        Gimmy   Four    88    male
16  17        Tumyu    Six    54    male
17  18        Honny   Five    75    male
18  19        Tinny   Nine    18    male
19  20       Jackly   Nine    65  female
20  21   Babby John   Four    69  female
21  22       Reggid  Seven    55  female
22  23        Herod  Eight    79    male
23  24    Tiddy Now  Seven    78    male
24  25     Giff Tow  Seven    88    male
25  26       Crelea  Seven    79    male
26  27     Big Nose  Three    81  female
27  28    Rojj Base  Seven    86  female
28  29  Tess Played  Seven    55    male
29  30    Reppy Red    Six    79  female
30  31  Marry Toeey   Four    88    male
31  32    Binn Rott  Seven    90  female
32  33    Kenn Rein    Six    96  female
33  34     Gain Toe  Seven    69    male
34  35   Rows Noump    Six    88  female
35  36     Abhishek   five    45    male

In [41]:
df.head(3)

   id      name  class  mark  gender
0   1  John Deo   Four    75  female
1   2  Max Ruin  Three    85    male
2   3    Arnold  Three    55    male

In [42]:
df.drop((df.loc[(df["mark"]<50)]).index)
df

    id         name  class  mark  gender
0    1     John Deo   Four    75  female
1    2     Max Ruin  Three    85    male
2    3       Arnold  Three    55    male
3    4   Krish Star   Four    60  female
4    5    John Mike   Four    60  female
5    6    Alex John   Four    55    male
6    7  My John Rob  Fifth    78    male
7    8       Asruid   Five    85    male
8    9      Tes Qry    Six    78    male
9   10     Big John   Four    55  female
10  11       Ronald    Six    89  female
11  12        Recky    Six    94  female
12  13          Kty  Seven    88  female
13  14         Bigy  Seven    88  female
14  15     Tade Row   Four    88    male
15  16        Gimmy   Four    88    male
16  17        Tumyu    Six    54    male
17  18        Honny   Five    75    male
18  19        Tinny   Nine    18    male
19  20       Jackly   Nine    65  female
20  21   Babby John   Four    69  female
21  22       Reggid  Seven    55  female
22  23        Herod  Eight    79    male
23  24    Tiddy Now  Seven    78    male
24  25     Giff Tow  Seven    88    male
25  26       Crelea  Seven    79    male
26  27     Big Nose  Three    81  female
27  28    Rojj Base  Seven    86  female
28  29  Tess Played  Seven    55    male
29  30    Reppy Red    Six    79  female
30  31  Marry Toeey   Four    88    male
31  32    Binn Rott  Seven    90  female
32  33    Kenn Rein    Six    96  female
33  34     Gain Toe  Seven    69    male
34  35   Rows Noump    Six    88  female
35  36     Abhishek   five    45    male

In [43]:
df = pd.read_csv("student.csv")
df.drop((df.loc[(df["mark"]>50)]).index)
df

    id         name  class  mark  gender
0    1     John Deo   Four    75  female
1    2     Max Ruin  Three    85    male
2    3       Arnold  Three    55    male
3    4   Krish Star   Four    60  female
4    5    John Mike   Four    60  female
5    6    Alex John   Four    55    male
6    7  My John Rob  Fifth    78    male
7    8       Asruid   Five    85    male
8    9      Tes Qry    Six    78    male
9   10     Big John   Four    55  female
10  11       Ronald    Six    89  female
11  12        Recky    Six    94  female
12  13          Kty  Seven    88  female
13  14         Bigy  Seven    88  female
14  15     Tade Row   Four    88    male
15  16        Gimmy   Four    88    male
16  17        Tumyu    Six    54    male
17  18        Honny   Five    75    male
18  19        Tinny   Nine    18    male
19  20       Jackly   Nine    65  female
20  21   Babby John   Four    69  female
21  22       Reggid  Seven    55  female
22  23        Herod  Eight    79    male
23  24    Tiddy Now  Seven    78    male
24  25     Giff Tow  Seven    88    male
25  26       Crelea  Seven    79    male
26  27     Big Nose  Three    81  female
27  28    Rojj Base  Seven    86  female
28  29  Tess Played  Seven    55    male
29  30    Reppy Red    Six    79  female
30  31  Marry Toeey   Four    88    male
31  32    Binn Rott  Seven    90  female
32  33    Kenn Rein    Six    96  female
33  34     Gain Toe  Seven    69    male
34  35   Rows Noump    Six    88  female

In [44]:
df.iloc[[5],]

   id       name class  mark gender
5   6  Alex John  Four    55   male

In [45]:
df.iloc[[4],]

   id       name class  mark  gender
4   5  John Mike  Four    60  female

In [46]:
df.iloc[:5]

   id        name  class  mark  gender
0   1    John Deo   Four    75  female
1   2    Max Ruin  Three    85    male
2   3      Arnold  Three    55    male
3   4  Krish Star   Four    60  female
4   5   John Mike   Four    60  female

In [47]:
df.head(3)

   id      name  class  mark  gender
0   1  John Deo   Four    75  female
1   2  Max Ruin  Three    85    male
2   3    Arnold  Three    55    male

In [48]:
result = {class1 : len(class1) for class1 in df["class"]}
result

{'Four': 4,
 'Three': 5,
 'Fifth': 5,
 'Five': 4,
 'Six': 3,
 'Seven': 5,
 'Nine': 4,
 'Eight': 5}

In [49]:
result = {class1 : len(class1) for class1 in df["class"]}
result

{'Four': 4,
 'Three': 5,
 'Fifth': 5,
 'Five': 4,
 'Six': 3,
 'Seven': 5,
 'Nine': 4,
 'Eight': 5}

In [50]:
result = {class1 : len(class1) for class1 in df["class"]}
result

{'Four': 4,
 'Three': 5,
 'Fifth': 5,
 'Five': 4,
 'Six': 3,
 'Seven': 5,
 'Nine': 4,
 'Eight': 5}

In [51]:
df.head(3)

   id      name  class  mark  gender
0   1  John Deo   Four    75  female
1   2  Max Ruin  Three    85    male
2   3    Arnold  Three    55    male

In [52]:
df["name"] = pd.DataFrame(df["name"].apply(lambda x : x.swapcase()))
df

    id         name  class  mark  gender
0    1     jOHN dEO   Four    75  female
1    2     mAX rUIN  Three    85    male
2    3       aRNOLD  Three    55    male
3    4   kRISH sTAR   Four    60  female
4    5    jOHN mIKE   Four    60  female
5    6    aLEX jOHN   Four    55    male
6    7  mY jOHN rOB  Fifth    78    male
7    8       aSRUID   Five    85    male
8    9      tES qRY    Six    78    male
9   10     bIG jOHN   Four    55  female
10  11       rONALD    Six    89  female
11  12        rECKY    Six    94  female
12  13          kTY  Seven    88  female
13  14         bIGY  Seven    88  female
14  15     tADE rOW   Four    88    male
15  16        gIMMY   Four    88    male
16  17        tUMYU    Six    54    male
17  18        hONNY   Five    75    male
18  19        tINNY   Nine    18    male
19  20       jACKLY   Nine    65  female
20  21   bABBY jOHN   Four    69  female
21  22       rEGGID  Seven    55  female
22  23        hEROD  Eight    79    male
23  24    tIDDY nOW  Seven    78    male
24  25     gIFF tOW  Seven    88    male
25  26       cRELEA  Seven    79    male
26  27     bIG nOSE  Three    81  female
27  28    rOJJ bASE  Seven    86  female
28  29  tESS pLAYED  Seven    55    male
29  30    rEPPY rED    Six    79  female
30  31  mARRY tOEEY   Four    88    male
31  32    bINN rOTT  Seven    90  female
32  33    kENN rEIN    Six    96  female
33  34     gAIN tOE  Seven    69    male
34  35   rOWS nOUMP    Six    88  female

In [53]:
df["name"] = df["name"].apply(lambda x : x.lower())
df

    id         name  class  mark  gender
0    1     john deo   Four    75  female
1    2     max ruin  Three    85    male
2    3       arnold  Three    55    male
3    4   krish star   Four    60  female
4    5    john mike   Four    60  female
5    6    alex john   Four    55    male
6    7  my john rob  Fifth    78    male
7    8       asruid   Five    85    male
8    9      tes qry    Six    78    male
9   10     big john   Four    55  female
10  11       ronald    Six    89  female
11  12        recky    Six    94  female
12  13          kty  Seven    88  female
13  14         bigy  Seven    88  female
14  15     tade row   Four    88    male
15  16        gimmy   Four    88    male
16  17        tumyu    Six    54    male
17  18        honny   Five    75    male
18  19        tinny   Nine    18    male
19  20       jackly   Nine    65  female
20  21   babby john   Four    69  female
21  22       reggid  Seven    55  female
22  23        herod  Eight    79    male
23  24    tiddy now  Seven    78    male
24  25     giff tow  Seven    88    male
25  26       crelea  Seven    79    male
26  27     big nose  Three    81  female
27  28    rojj base  Seven    86  female
28  29  tess played  Seven    55    male
29  30    reppy red    Six    79  female
30  31  marry toeey   Four    88    male
31  32    binn rott  Seven    90  female
32  33    kenn rein    Six    96  female
33  34     gain toe  Seven    69    male
34  35   rows noump    Six    88  female

In [57]:
df["name"] = df["name"].apply(lambda x : x.upper())
df

    id         name  class  mark  gender
0    1     JOHN DEO   Four    75  female
1    2     MAX RUIN  Three    85    male
2    3       ARNOLD  Three    55    male
3    4   KRISH STAR   Four    60  female
4    5    JOHN MIKE   Four    60  female
5    6    ALEX JOHN   Four    55    male
6    7  MY JOHN ROB  Fifth    78    male
7    8       ASRUID   Five    85    male
8    9      TES QRY    Six    78    male
9   10     BIG JOHN   Four    55  female
10  11       RONALD    Six    89  female
11  12        RECKY    Six    94  female
12  13          KTY  Seven    88  female
13  14         BIGY  Seven    88  female
14  15     TADE ROW   Four    88    male
15  16        GIMMY   Four    88    male
16  17        TUMYU    Six    54    male
17  18        HONNY   Five    75    male
18  19        TINNY   Nine    18    male
19  20       JACKLY   Nine    65  female
20  21   BABBY JOHN   Four    69  female
21  22       REGGID  Seven    55  female
22  23        HEROD  Eight    79    male
23  24    TIDDY NOW  Seven    78    male
24  25     GIFF TOW  Seven    88    male
25  26       CRELEA  Seven    79    male
26  27     BIG NOSE  Three    81  female
27  28    ROJJ BASE  Seven    86  female
28  29  TESS PLAYED  Seven    55    male
29  30    REPPY RED    Six    79  female
30  31  MARRY TOEEY   Four    88    male
31  32    BINN ROTT  Seven    90  female
32  33    KENN REIN    Six    96  female
33  34     GAIN TOE  Seven    69    male
34  35   ROWS NOUMP    Six    88  female

In [58]:
df["name"] = df["name"].apply(lambda x : x.lower())
df

    id         name  class  mark  gender
0    1     john deo   Four    75  female
1    2     max ruin  Three    85    male
2    3       arnold  Three    55    male
3    4   krish star   Four    60  female
4    5    john mike   Four    60  female
5    6    alex john   Four    55    male
6    7  my john rob  Fifth    78    male
7    8       asruid   Five    85    male
8    9      tes qry    Six    78    male
9   10     big john   Four    55  female
10  11       ronald    Six    89  female
11  12        recky    Six    94  female
12  13          kty  Seven    88  female
13  14         bigy  Seven    88  female
14  15     tade row   Four    88    male
15  16        gimmy   Four    88    male
16  17        tumyu    Six    54    male
17  18        honny   Five    75    male
18  19        tinny   Nine    18    male
19  20       jackly   Nine    65  female
20  21   babby john   Four    69  female
21  22       reggid  Seven    55  female
22  23        herod  Eight    79    male
23  24    tiddy now  Seven    78    male
24  25     giff tow  Seven    88    male
25  26       crelea  Seven    79    male
26  27     big nose  Three    81  female
27  28    rojj base  Seven    86  female
28  29  tess played  Seven    55    male
29  30    reppy red    Six    79  female
30  31  marry toeey   Four    88    male
31  32    binn rott  Seven    90  female
32  33    kenn rein    Six    96  female
33  34     gain toe  Seven    69    male
34  35   rows noump    Six    88  female

In [59]:
list1 = ['Amir ',' Ashwin',' Bhakti ',' Amol','Aishwarya ','Satyam ']
s1 = pd.Series(list1)
s1

0         Amir
1        Ashwin
2       Bhakti
3          Amol
4    Aishwarya
5       Satyam
dtype: object

In [60]:
s1 = s1.apply(lambda x : x.strip())
s1

0         Amir
1       Ashwin
2       Bhakti
3         Amol
4    Aishwarya
5       Satyam
dtype: object

In [61]:
list1 = ['Amir ',' Ashwin',' Bhakti ',' Amol','Aishwarya ','Satyam ']
s1 = pd.Series(list1)
print(s1)
s1 = s1.apply(lambda x : x.strip())
s1

0         Amir
1        Ashwin
2       Bhakti
3          Amol
4    Aishwarya
5       Satyam
dtype: object

0         Amir
1       Ashwin
2       Bhakti
3         Amol
4    Aishwarya
5       Satyam
dtype: object

In [62]:
data = {'year': [1700, 1850, 2000, 2300, 1950]}
df = pd.DataFrame(data)
print(df)
result = df[(df["year"] >= 1800) & (df["year"] <= 2200)]
result

   year
0  1700
1  1850
2  2000
3  2300
4  1950

   year
1  1850
2  2000
4  1950

In [63]:
df1 = pd.DataFrame(np.random.randint(1,10,size=(3,3)),columns=list("ABC"),index=list("pqr"))
df2 = pd.DataFrame(np.random.randint(100,1000,size=(4,4)),columns=list("ABCD"),index=list("pqrs"))
df1

   A  B  C
p  3  9  7
q  3  9  2
r  4  1  3

In [64]:
df2

     A    B    C    D
p  371  556  390  327
q  326  559  548  786
r  784  882  916  922
s  274  667  463  191

In [65]:
pd.concat([df1,df2])

     A    B    C      D
p    3    9    7    NaN
q    3    9    2    NaN
r    4    1    3    NaN
p  371  556  390  327.0
q  326  559  548  786.0
r  784  882  916  922.0
s  274  667  463  191.0

In [66]:
pd.concat([df1,df2],axis=1)

     A    B    C    A    B    C    D
p  3.0  9.0  7.0  371  556  390  327
q  3.0  9.0  2.0  326  559  548  786
r  4.0  1.0  3.0  784  882  916  922
s  NaN  NaN  NaN  274  667  463  191

In [67]:
df1=pd.DataFrame({"Name":["Aarathi","Veena","Lakshmipriya","Sriyan"],
"Age":[23,54,34,67],
"Location":["Pune","Bangalore","Pune","Kochi"]})
df2=pd.DataFrame({"Name":["Aara","Anupama","Robin","Dilsha","Ramya"],
"Age":[23,54,34,67,45],
"Maths":[34,45,50,49,46],
"English":[50,49,48,34,89],
"Hindi":[40,45,50,34,67]})
df3=pd.DataFrame({"Name":["Aarathi","Veena","Sriyan","Dilsha","Arohi"],
"Salary":[80000,70000,90000,780000,90000]})
df1

           Name  Age   Location
0       Aarathi   23       Pune
1         Veena   54  Bangalore
2  Lakshmipriya   34       Pune
3        Sriyan   67      Kochi

In [68]:
df2

      Name  Age  Maths  English  Hindi
0     Aara   23     34       50     40
1  Anupama   54     45       49     45
2    Robin   34     50       48     50
3   Dilsha   67     49       34     34
4    Ramya   45     46       89     67

In [69]:
df3

      Name  Salary
0  Aarathi   80000
1    Veena   70000
2   Sriyan   90000
3   Dilsha  780000
4    Arohi   90000

In [70]:
result = pd.concat([df1,df2])
result

           Name  Age   Location  Maths  English  Hindi
0       Aarathi   23       Pune    NaN      NaN    NaN
1         Veena   54  Bangalore    NaN      NaN    NaN
2  Lakshmipriya   34       Pune    NaN      NaN    NaN
3        Sriyan   67      Kochi    NaN      NaN    NaN
0          Aara   23        NaN   34.0     50.0   40.0
1       Anupama   54        NaN   45.0     49.0   45.0
2         Robin   34        NaN   50.0     48.0   50.0
3        Dilsha   67        NaN   49.0     34.0   34.0
4         Ramya   45        NaN   46.0     89.0   67.0

In [71]:
result1 = pd.merge(result , df3 , on="Name")
result1

      Name  Age   Location  Maths  English  Hindi  Salary
0  Aarathi   23       Pune    NaN      NaN    NaN   80000
1    Veena   54  Bangalore    NaN      NaN    NaN   70000
2   Sriyan   67      Kochi    NaN      NaN    NaN   90000
3   Dilsha   67        NaN   49.0     34.0   34.0  780000

In [72]:
df1 = pd.DataFrame({"Name":["Aarathi","Veena","Lakshmipriya","Amit","Sriyan"],
"ID_card":['BSL004','BSL006','BSL010','BSL003','BSL007'],
"Physics":[94,86,73,96,75],
"Cemistry":[85,91,89,78,81]})
df2 = pd.DataFrame({"Name":["Aarathi","Veena","Manoj","Lakshmipriya","Sriyan"],
"ID_card":['BSL001','BSL005','BSL009','BSL008','BSL002'],
"Maths":[88,72,69,97,45],
"Biology":[98,75,86,61,64]})
df1

           Name ID_card  Physics  Cemistry
0       Aarathi  BSL004       94        85
1         Veena  BSL006       86        91
2  Lakshmipriya  BSL010       73        89
3          Amit  BSL003       96        78
4        Sriyan  BSL007       75        81

In [73]:
df2

           Name ID_card  Maths  Biology
0       Aarathi  BSL001     88       98
1         Veena  BSL005     72       75
2         Manoj  BSL009     69       86
3  Lakshmipriya  BSL008     97       61
4        Sriyan  BSL002     45       64

In [74]:
result = pd.merge(df1,df2,on="Name",suffixes=["_df1","_df2"])
result

           Name ID_card_df1  Physics  Cemistry ID_card_df2  Maths  Biology
0       Aarathi      BSL004       94        85      BSL001     88       98
1         Veena      BSL006       86        91      BSL005     72       75
2  Lakshmipriya      BSL010       73        89      BSL008     97       61
3        Sriyan      BSL007       75        81      BSL002     45       64

In [75]:
df1

           Name ID_card  Physics  Cemistry
0       Aarathi  BSL004       94        85
1         Veena  BSL006       86        91
2  Lakshmipriya  BSL010       73        89
3          Amit  BSL003       96        78
4        Sriyan  BSL007       75        81

In [76]:
df2

           Name ID_card  Maths  Biology
0       Aarathi  BSL001     88       98
1         Veena  BSL005     72       75
2         Manoj  BSL009     69       86
3  Lakshmipriya  BSL008     97       61
4        Sriyan  BSL002     45       64

In [77]:
result = pd.merge(df1,df2,how="left")
result

           Name ID_card  Physics  Cemistry  Maths  Biology
0       Aarathi  BSL004       94        85    NaN      NaN
1         Veena  BSL006       86        91    NaN      NaN
2  Lakshmipriya  BSL010       73        89    NaN      NaN
3          Amit  BSL003       96        78    NaN      NaN
4        Sriyan  BSL007       75        81    NaN      NaN

In [78]:
result = pd.merge(df1,df2,how="right")
result

           Name ID_card  Physics  Cemistry  Maths  Biology
0       Aarathi  BSL001      NaN       NaN     88       98
1         Veena  BSL005      NaN       NaN     72       75
2         Manoj  BSL009      NaN       NaN     69       86
3  Lakshmipriya  BSL008      NaN       NaN     97       61
4        Sriyan  BSL002      NaN       NaN     45       64

In [80]:
result = pd.merge(df1,df2,how="left",on="Name",suffixes=["_df1","_df2"])
result

           Name ID_card_df1  Physics  Cemistry ID_card_df2  Maths  Biology
0       Aarathi      BSL004       94        85      BSL001   88.0     98.0
1         Veena      BSL006       86        91      BSL005   72.0     75.0
2  Lakshmipriya      BSL010       73        89      BSL008   97.0     61.0
3          Amit      BSL003       96        78         NaN    NaN      NaN
4        Sriyan      BSL007       75        81      BSL002   45.0     64.0

In [81]:
result = pd.merge(df1,df2,how="right")
result

           Name ID_card  Physics  Cemistry  Maths  Biology
0       Aarathi  BSL001      NaN       NaN     88       98
1         Veena  BSL005      NaN       NaN     72       75
2         Manoj  BSL009      NaN       NaN     69       86
3  Lakshmipriya  BSL008      NaN       NaN     97       61
4        Sriyan  BSL002      NaN       NaN     45       64

In [82]:
result = pd.merge(df1,df2,how="left",on="Name",suffixes=["_df1","_df2"])
result

           Name ID_card_df1  Physics  Cemistry ID_card_df2  Maths  Biology
0       Aarathi      BSL004       94        85      BSL001   88.0     98.0
1         Veena      BSL006       86        91      BSL005   72.0     75.0
2  Lakshmipriya      BSL010       73        89      BSL008   97.0     61.0
3          Amit      BSL003       96        78         NaN    NaN      NaN
4        Sriyan      BSL007       75        81      BSL002   45.0     64.0

In [83]:
result = pd.merge(df1,df2,how="right",on="Name",suffixes=["_df1","_df2"])
result

           Name ID_card_df1  Physics  Cemistry ID_card_df2  Maths  Biology
0       Aarathi      BSL004     94.0      85.0      BSL001     88       98
1         Veena      BSL006     86.0      91.0      BSL005     72       75
2         Manoj         NaN      NaN       NaN      BSL009     69       86
3  Lakshmipriya      BSL010     73.0      89.0      BSL008     97       61
4        Sriyan      BSL007     75.0      81.0      BSL002     45       64

In [84]:
english_df = pd.DataFrame({'Name':['Amir','Salman','Maaz','Tanvir','Fahad'],
'Surname':['Arkar','Mulla','Surve','Kadvekar','Antule'],
'Marks':[94,86,91,93,88]})
maths_df = pd.DataFrame({'Name':['Amir','Salman','Maaz','Tanvir','Fahad'],
'Surname':['Khan','Mulla','Hafiz','Kadvekar','Shaikh'],
'Marks':[91,89,93,87,84]})
english_df

     Name   Surname  Marks
0    Amir     Arkar     94
1  Salman     Mulla     86
2    Maaz     Surve     91
3  Tanvir  Kadvekar     93
4   Fahad    Antule     88

In [85]:
maths_df

     Name   Surname  Marks
0    Amir      Khan     91
1  Salman     Mulla     89
2    Maaz     Hafiz     93
3  Tanvir  Kadvekar     87
4   Fahad    Shaikh     84

In [86]:
result = pd.merge(english_df,maths_df,how="inner",on=["Name","Surname"],suffixes=["_df1","_df2"])
result

     Name   Surname  Marks_df1  Marks_df2
0  Salman     Mulla         86         89
1  Tanvir  Kadvekar         93         87

In [87]:
physics_df = pd.DataFrame({'Name_1':['Amir','Salman','Maaz','Karim','Fahad'],
'Surname':['Arkar','Mulla','Surve','Kadvekar','Antule'],
'Marks':[94,86,91,93,88]})
chemistry_df = pd.DataFrame({'Name_2':['Asif','Salman','Maaz','Tanvir','Fahad'],
'Surname':['Khan','Mulla','Hafiz','Rawal','Shaikh'],
'Marks':[91,89,93,87,84]})
physics_df

   Name_1   Surname  Marks
0    Amir     Arkar     94
1  Salman     Mulla     86
2    Maaz     Surve     91
3   Karim  Kadvekar     93
4   Fahad    Antule     88

In [88]:
chemistry_df

   Name_2 Surname  Marks
0    Asif    Khan     91
1  Salman   Mulla     89
2    Maaz   Hafiz     93
3  Tanvir   Rawal     87
4   Fahad  Shaikh     84

In [90]:
result = pd.merge(physics_df,chemistry_df,how="inner",left_on="Name_1",right_on="Name_2",suffixes=["_1","_2"])
result

   Name_1 Surname_1  Marks_1  Name_2 Surname_2  Marks_2
0  Salman     Mulla       86  Salman     Mulla       89
1    Maaz     Surve       91    Maaz     Hafiz       93
2   Fahad    Antule       88   Fahad    Shaikh       84

In [91]:
df = pd.read_csv("movies_data.csv")
df.head(3)

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."

In [92]:
result = df.sort_values("duration",ignore_index=True,ascending=False)
result

,star_rating,title,content_rating,genre,duration,actors_list
0,7.8,Hamlet,PG-13,Drama,242,"[u'Kenneth Branagh', u'Julie Christie', u'Dere..."
1,8.2,Gone with the Wind,G,Drama,238,"[u'Clark Gable', u'Vivien Leigh', u'Thomas Mit..."
2,8.4,Once Upon a Time in America,R,Crime,229,"[u'Robert De Niro', u'James Woods', u'Elizabet..."
3,8.3,Lagaan: Once Upon a Time in India,PG,Adventure,224,"[u'Aamir Khan', u'Gracy Singh', u'Rachel Shell..."
4,7.9,The Ten Commandments,APPROVED,Adventure,220,"[u'Charlton Heston', u'Yul Brynner', u'Anne Ba..."
...,...,...,...,...,...,...
974,8.1,Duck Soup,PASSED,Comedy,68,"[u'Groucho Marx', u'Harpo Marx', u'Chico Marx']"
975,8.4,The Kid,NOT RATED,Comedy,68,"[u'Charles Chaplin', u'Edna Purviance', u'Jack..."
976,8.1,The Cabinet of Dr. Caligari,UNRATED,Crime,67,"[u'Werner Krauss', u'Conrad Veidt', u'Friedric..."
977,8.0,Battleship Potemkin,UNRATED,History,66,"[u'Aleksandr Antonov', u'Vladimir Barsky', u'G..."
978,8.0,Freaks,UNRATED,Drama,64,"[u'Wallace Ford', u'Leila Hyams', u'Olga Bacla..."

In [93]:
longest_runtime = df["duration"].max()
shortest_runtime = df["duration"].min()
print("Longest runtime:",longest_runtime)
print("Shortest runtime:",shortest_runtime)

Longest runtime: 242
Shortest runtime: 64

In [94]:
result = df.loc[(df["genre"]=="Action") | (df["genre"]=="Crime")].reset_index(drop=True)
result

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."
...,...,...,...,...,...,...
255,7.4,La Femme Nikita,R,Action,118,"[u'Anne Parillaud', u'Marc Duret', u'Patrick F..."
256,7.4,The Rock,R,Action,136,"[u'Sean Connery', u'Nicolas Cage', u'Ed Harris']"
257,7.4,Law Abiding Citizen,R,Crime,109,"[u'Gerard Butler', u'Jamie Foxx', u'Leslie Bibb']"
258,7.4,Master and Commander: The Far Side of the World,PG-13,Action,138,"[u'Russell Crowe', u'Paul Bettany', u'Billy Bo..."
259,7.4,Wall Street,R,Crime,126,"[u'Charlie Sheen', u'Michael Douglas', u'Tamar..."

In [95]:
city_df = pd.DataFrame({'Name':['Amir','Shaibaz','Suhel','Fahad','Adil','Muzaffar','Shuaib','Asif','Awez','Muzammil'],
'City':['Georgia','California','Los Angeles','California','Los Angeles','Georgia','Los Angeles',
'California','Los Angeles','California']})
city_df

       Name         City
0      Amir      Georgia
1   Shaibaz   California
2     Suhel  Los Angeles
3     Fahad   California
4      Adil  Los Angeles
5  Muzaffar      Georgia
6    Shuaib  Los Angeles
7      Asif   California
8      Awez  Los Angeles
9  Muzammil   California

In [96]:
result = city_df.groupby(city_df["City"]).size().reset_index(name = "Number of people")
result

          City  Number of people
0   California                 4
1      Georgia                 2
2  Los Angeles                 4

In [97]:
result = city_df.groupby(city_df["City"]).size().reset_index(name="Number of People")
result

          City  Number of People
0   California                 4
1      Georgia                 2
2  Los Angeles                 4

In [98]:
df = pd.read_csv("Bengaluru_House_Data.csv")
df.head(3)

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00

In [99]:
df.fillna(0)

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,0,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,0,1200,2.0,1.0,51.00
...,...,...,...,...,...,...,...,...,...
13315,Built-up Area,Ready To Move,Whitefield,5 Bedroom,ArsiaEx,3453,4.0,0.0,231.00
13316,Super built-up Area,Ready To Move,Richards Town,4 BHK,0,3600,5.0,0.0,400.00
13317,Built-up Area,Ready To Move,Raja Rajeshwari Nagar,2 BHK,Mahla T,1141,2.0,1.0,60.00
13318,Super built-up Area,18-Jun,Padmanabhanagar,4 BHK,SollyCl,4689,4.0,1.0,488.00
13319,Super built-up Area,Ready To Move,Doddathoguru,1 BHK,0,550,1.0,1.0,17.00

In [100]:
df.replace({np.nan:0})

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,0,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,0,1200,2.0,1.0,51.00
...,...,...,...,...,...,...,...,...,...
13315,Built-up Area,Ready To Move,Whitefield,5 Bedroom,ArsiaEx,3453,4.0,0.0,231.00
13316,Super built-up Area,Ready To Move,Richards Town,4 BHK,0,3600,5.0,0.0,400.00
13317,Built-up Area,Ready To Move,Raja Rajeshwari Nagar,2 BHK,Mahla T,1141,2.0,1.0,60.00
13318,Super built-up Area,18-Jun,Padmanabhanagar,4 BHK,SollyCl,4689,4.0,1.0,488.00
13319,Super built-up Area,Ready To Move,Doddathoguru,1 BHK,0,550,1.0,1.0,17.00

In [101]:
df = pd.DataFrame({'col1':[1,4,3,4,5],
'col2':[4,5,6,7,8],
'col3':[7,8,9,0,1]})
df

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

In [102]:
result = df.drop([0,2,4])
result

   col1  col2  col3
1     4     5     8
3     4     7     0

In [1]:
user_input = input("Enter a string:")
for i in user_input:
    print(i)

A
b
h
i
s
h
e
k

In [2]:
string = "Machine Learning"
result = len(string)
result

16

In [3]:
string = "Machine Learning"
count1 = 0 
for i in string:
    count1 += 1 
print(f"Length of string is {count1}")

Length of string is 16

In [4]:
sentence = "This is orange juice"
keyword = "orange"
if keyword in sentence:
    print(f"{keyword} is present in sentence")
else:
    print(f"{keyword} is not present in sentence")

orange is present in sentence

In [5]:
input_string = input("Enter a string:")
vowels = "aeiou"
consonants = "bcdfghjklmnpqrstvwxyz"
digits = "0123456789"
vowel_count = 0 
consonant_count = 0
digit_count = 0
whitespace_count = 0
for i in input_string:
    if i.lower() in vowels:
        vowel_count += 1 
    if i.lower() in consonants:
        consonant_count += 1
    if i in digits:
        digit_count += 1
    if i.isspace():
        whitespace_count += 1
print("Vowels count : ", vowel_count)
print("Consonant count : ", consonant_count)
print("Digit count : ", digit_count)
print("Whitespace count : ", whitespace_count)

Vowels count :  7
Consonant count :  10
Digit count :  0
Whitespace count :  1

In [6]:
input_string = input("Enter a string:")
uppercase_count = 0 
lowercase_count = 0 
special_count = 0
numeric_count = 0
for i in input_string:
    if i.islower():
        lowercase_count += 1 
    elif i.isupper():
        uppercase_count += 1
    elif i.isdigit():
        numeric_count += 1
    else:
        special_count += 1
print("Upper case count: ", uppercase_count)
print("Lower case count: ",lowercase_count)
print("Special count: ",special_count)
print("Number of digits: ",numeric_count)

Upper case count:  0
Lower case count:  8
Special count:  1
Number of digits:  4

In [7]:
input_string = "Hello,have a good day"
vowels = "aeiouAEIOU"
new_string = ""
for i in input_string:
    if i.isalpha() and i in vowels:
        new_string += i 


print("original string:",input_string)
print("New string with consonants deleted:",new_string)

original string: Hello,have a good day
New string with consonants deleted: eoaeaooa

In [8]:
input_string = input("Enter a non-empty string")
index = int(input("Enter the index of the string to be removed"))

if index < 0 or index > len(input_string):
    print("Invalid index")
else:
    new_string = input_string[:index] + input_string[index+1:]
    print("Original string:",input_string)
    print("New string with index removed:",new_string)

Original string: Abhihsek
New string with index removed: Abhhsek

In [9]:
input_string = input("Enter a string:")
if len(input_string) < 2:
    print("String should be at least 2 characters long")
else:
    new_string = input_string[-1] + input_string[1:-1] + input_string[0]
    print("Original string:",input_string)
    print("String with first and last characters removed:",new_string)

Original string: Abhishek
String with first and last characters removed: kbhisheA

In [11]:
input_string = str(input("Enter a string:"))
word = ""
for i in input_string:
    word = i 
    count = input_string.count(word)
    print(f"In the given string {word} is been repeated {count} times")

In the given string A is been repeated 1 times
In the given string b is been repeated 1 times
In the given string h is been repeated 2 times
In the given string i is been repeated 1 times
In the given string s is been repeated 1 times
In the given string h is been repeated 2 times
In the given string e is been repeated 1 times
In the given string k is been repeated 1 times

In [12]:
input_string = str(input("Enter a string:"))
word = ""
for i in input_string:
    word = i 
    count = input_string.count(word)
    print(f"In the given string {word} is been repeated {count} times")

In the given string W is been repeated 1 times
In the given string a is been repeated 2 times
In the given string k is been repeated 1 times
In the given string c is been repeated 1 times
In the given string h is been repeated 1 times
In the given string a is been repeated 2 times
In the given string u is been repeated 1 times
In the given string r is been repeated 1 times
In the given string e is been repeated 1 times

In [13]:
input_string = str(input("Enter a string:"))
split1 = input_string.split()
for i in split1:
    if i in split1:
        split1.count(i)
        print(f"{i} : {split1.count(i)}")
    else:
        print("Word is not repeated")

Abhishek : 1
Wakchaure : 1

In [14]:
input_string = str(input("Enter a string:"))
split1 = input_string.split()
for i in split1:
    if i in split1:
        split1.count(i)
        print(f"{i} : {split1.count(i)}")
    else:
        print("Word is not repeated")

Abhishek : 1
Wakchaure : 1

In [16]:
input_string = input("Enter a string:")
result = input_string[-10:]
result

' Wakchaure'

In [17]:
input_string = input("Enter a string:")
uppercase_count = 0 
for i in input_string[:4]:
    if i.isupper():
        uppercase_count += 1 
if uppercase_count >= 2:
    uppercase_string = input_string.upper()
    print("Uppercase string:",uppercase_string)
else:
    print("No conversion required")

Uppercase string: ABHISHEK WAKCHAURE

In [19]:
input_string = "This is a string with a newline.\n"
result = input_string.replace("\n","")
print("Original string:",input_string)
print("New string without newline:",result)

Original string: This is a string with a newline.

New string without newline: This is a string with a newline.

In [21]:
input_string = "32.054,23"
result = input_string.replace(",","*").replace(".",",").replace("*",".")
result

'32,054.23'

In [23]:
input_string = input("Enter a string:")
char_count = {}
for i in input_string:
    if i in char_count:
        print("First repeated char:",i)
        break
    char_count[i] = 1 
else:
    print("No repeated character found")

First repeated char: h

In [24]:
input_string = input("Enter a string:")
even_count = 0 
odd_count = 0

for i in input_string:
    if i.isdigit():
        num = int(i)
        if num % 2 == 0:
            even_count += 1 
        else:
            odd_count += 1
print("Even numbers count :",even_count)
print("odd number count :",odd_count)

Even numbers count : 3
odd number count : 3

In [25]:
input_string = input("Enter a string:")
if input_string.isdigit() == True:
    print("String contains only digits")
else:
    print("String contains alphabetes")

String contains alphabetes

In [27]:
input1 = "Abhishek"
result = input1.replace("b","")
result

'Ahishek'

In [28]:
input1 = "Abhishek"
k = []
for i in input1:
    if input1.index(i) % 2 != 0 :
        k.append(i)

print(k)

['b', 'i', 'k']

In [29]:
input_string = input("Enter a string:")
if len(input_string)%5==0:
    result = input_string[::-1]
    print(result)
else:
    print("Length is not multiple of 5")

 eruahckaW

In [30]:
input_string = str(input("Enter a string:"))
result = input_string[::-1]
result

'kehsihbA'

In [31]:
input_string = str(input("Enter a string:"))
result = input_string.swapcase()
result

'aBHISHEK'

In [32]:
input_string = str(input("Enter a string:"))
result = input_string.replace(" ","")
result

'AbhishekWakchaure'

In [33]:
input_string = str(input("Enter a string:"))
result = []
for i in input_string:
    if i not in result:
        result.append(i)
result

['A', 'b', 'h', 'i', 's', 'e', 'k']

In [34]:
num = eval(input("Enter a number:"))
for i in range(0 , num+1):
    print(i*i)

0
1
4
9
16
25

In [35]:
num = eval(input("Enter a number:"))
for i in range(0 , num+1):
    print(i*i*i)

0
1
8
27
64
125

In [37]:
num = eval(input("Enter a number:"))
for i in range(2, num):
    if num % i == 0:
        print("Not prime")
        break
    else:
        print("Prime number")
        break

Not prime

In [40]:
num = eval(input("Enter a number:"))
for i in range(2 , num):
    if num % i == 0:
        print("Not prime")
        break
    else:
        print("Prime number")
        break

Prime number